{
  "/deviceManagement/roleScopeTags/microsoft.graph.getRoleScopeTagsById": {
    "post": {
      "tags": [
        "deviceManagement.Actions"
      ],
      "summary": "Invoke action getRoleScopeTagsById",
      "operationId": "deviceManagement.roleScopeTag_getRoleScopeTagsGraphBPreId",
      "requestBody": {
        "description": "Action parameters",
        "content": {
          "application/json": {
            "schema": {
              "type": "object",
              "properties": {
                "roleScopeTagIds": {
                  "type": "array",
                  "items": {
                    "type": "string",
                    "nullable": true
                  }
                }
              },
              "additionalProperties": {
                "type": "object"
              }
            }
          }
        },
        "required": true
      },
      "responses": {
        "2XX": {
          "description": "Success",
          "content": {
            "application/json": {
              "schema": {
                "title": "Collection of roleScopeTag",
                "type": "object",
                "properties": {
                  "value": {
                    "type": "array",
                    "items": {
                      "$ref": "#/components/schemas/microsoft.graph.roleScopeTag"
                    }
                  },
                  "@odata.nextLink": {
                    "type": "string",
                    "nullable": true
                  }
                },
                "additionalProperties": {
                  "type": "object"
                }
              }
            }
          }
        },
        "default": {
          "$ref": "#/components/responses/error"
        }
      },
      "x-ms-docs-operation-type": "action",
      "x-ms-pageable": {
        "nextLinkName": "@odata.nextLink",
        "operationName": "listMore"
      }
    }
  }
}