{
  "/deviceManagement/templates/{deviceManagementTemplate-id}/microsoft.graph.createInstance": {
    "post": {
      "tags": [
        "deviceManagement.Actions"
      ],
      "summary": "Invoke action createInstance",
      "operationId": "deviceManagement.template_createInstance",
      "parameters": [
        {
          "name": "deviceManagementTemplate-id",
          "in": "path",
          "description": "The unique identifier of deviceManagementTemplate",
          "required": true,
          "style": "simple",
          "schema": {
            "type": "string"
          },
          "x-ms-docs-key-type": "deviceManagementTemplate"
        }
      ],
      "requestBody": {
        "description": "Action parameters",
        "content": {
          "application/json": {
            "schema": {
              "type": "object",
              "properties": {
                "displayName": {
                  "type": "string",
                  "nullable": true
                },
                "description": {
                  "type": "string",
                  "nullable": true
                },
                "settingsDelta": {
                  "type": "array",
                  "items": {
                    "$ref": "#/components/schemas/microsoft.graph.deviceManagementSettingInstance"
                  }
                },
                "roleScopeTagIds": {
                  "type": "array",
                  "items": {
                    "type": "string",
                    "nullable": true
                  }
                }
              },
              "additionalProperties": {
                "type": "object"
              }
            }
          }
        },
        "required": true
      },
      "responses": {
        "2XX": {
          "description": "Success",
          "content": {
            "application/json": {
              "schema": {
                "$ref": "#/components/schemas/microsoft.graph.deviceManagementIntent"
              }
            }
          }
        },
        "default": {
          "$ref": "#/components/responses/error"
        }
      },
      "x-ms-docs-operation-type": "action"
    }
  }
}