{
  "openapi": "3.0.1",
  "info": {
    "title": "DeviceManagement.Functions",
    "version": "v1.0-beta"
  },
  "servers": [
    {
      "url": "https://graph.microsoft.com/beta/",
      "description": "Core"
    }
  ],
  "components": {
    "schemas": {
      "microsoft.graph.assignmentFilterSupportedProperty": {
        "title": "assignmentFilterSupportedProperty",
        "type": "object",
        "properties": {
          "dataType": {
            "type": "string",
            "description": "The data type of the property.",
            "nullable": true
          },
          "isCollection": {
            "type": "boolean",
            "description": "Indicates whether the property is a collection type or not."
          },
          "name": {
            "type": "string",
            "description": "Name of the property.",
            "nullable": true
          },
          "propertyRegexConstraint": {
            "type": "string",
            "description": "Regex string to do validation on the property value.",
            "nullable": true
          },
          "supportedOperators": {
            "type": "array",
            "items": {
              "$ref": "#/components/schemas/microsoft.graph.assignmentFilterOperator"
            },
            "description": "List of all supported operators on this property."
          },
          "supportedValues": {
            "type": "array",
            "items": {
              "type": "string",
              "nullable": true
            },
            "description": "List of all supported values for this property, empty if everything is supported."
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Represents the information about the property which is supported in crafting the rule of AssignmentFilter."
      },
      "microsoft.graph.devicePlatformType": {
        "title": "devicePlatformType",
        "enum": [
          "android",
          "androidForWork",
          "iOS",
          "macOS",
          "windowsPhone81",
          "windows81AndLater",
          "windows10AndLater",
          "androidWorkProfile",
          "unknown",
          "androidAOSP",
          "androidMobileApplicationManagement",
          "iOSMobileApplicationManagement",
          "unknownFutureValue",
          "windowsMobileApplicationManagement"
        ],
        "type": "string",
        "description": "Supported platform types.",
        "x-ms-enum": {
          "name": "devicePlatformType",
          "modelAsString": false,
          "values": [
            {
              "value": "android",
              "description": "Android.",
              "name": "android"
            },
            {
              "value": "androidForWork",
              "description": "AndroidForWork.",
              "name": "androidForWork"
            },
            {
              "value": "iOS",
              "description": "iOS.",
              "name": "iOS"
            },
            {
              "value": "macOS",
              "description": "MacOS.",
              "name": "macOS"
            },
            {
              "value": "windowsPhone81",
              "description": "WindowsPhone 8.1.",
              "name": "windowsPhone81"
            },
            {
              "value": "windows81AndLater",
              "description": "Windows 8.1 and later",
              "name": "windows81AndLater"
            },
            {
              "value": "windows10AndLater",
              "description": "Windows 10 and later.",
              "name": "windows10AndLater"
            },
            {
              "value": "androidWorkProfile",
              "description": "Android Work Profile.",
              "name": "androidWorkProfile"
            },
            {
              "value": "unknown",
              "description": "Unknown.",
              "name": "unknown"
            },
            {
              "value": "androidAOSP",
              "description": "Android AOSP.",
              "name": "androidAOSP"
            },
            {
              "value": "androidMobileApplicationManagement",
              "description": "Indicates Mobile Application Management (MAM) for android devices.",
              "name": "androidMobileApplicationManagement"
            },
            {
              "value": "iOSMobileApplicationManagement",
              "description": "Indicates Mobile Application Management (MAM) for iOS devices",
              "name": "iOSMobileApplicationManagement"
            },
            {
              "value": "unknownFutureValue",
              "description": "Evolvable enumeration sentinel value. Do not use",
              "name": "unknownFutureValue"
            },
            {
              "value": "windowsMobileApplicationManagement",
              "description": "Indicates Mobile Application Management (MAM) for Windows devices.",
              "name": "windowsMobileApplicationManagement"
            }
          ]
        }
      },
      "microsoft.graph.assignmentFilterState": {
        "title": "assignmentFilterState",
        "type": "object",
        "properties": {
          "enabled": {
            "type": "boolean",
            "description": "Indicator to if AssignmentFilter is enabled or disabled."
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Represents result of GetState API."
      },
      "microsoft.graph.cloudPcRemoteActionResult": {
        "title": "cloudPcRemoteActionResult",
        "type": "object",
        "properties": {
          "actionName": {
            "type": "string",
            "description": "The specified action. Supported values in the Microsoft Endpoint Manager portal are: Reprovision, Resize, Restore. Supported values in enterprise Cloud PC devices are: Reboot, Rename, Reprovision, Troubleshoot.",
            "nullable": true
          },
          "actionState": {
            "$ref": "#/components/schemas/microsoft.graph.actionState"
          },
          "cloudPcId": {
            "type": "string",
            "description": "The ID of the Cloud PC device on which the remote action is performed. Read-only.",
            "nullable": true
          },
          "lastUpdatedDateTime": {
            "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
            "type": "string",
            "description": "Last update time for action. The Timestamp is shown in ISO 8601 format and Coordinated Universal Time (UTC). For example, midnight UTC on Jan 1, 2014 appears as\u202f'2014-01-01T00:00:00Z'.",
            "format": "date-time",
            "nullable": true
          },
          "managedDeviceId": {
            "type": "string",
            "description": "The ID of the Intune managed device on which the remote action is performed. Read-only.",
            "nullable": true
          },
          "startDateTime": {
            "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
            "type": "string",
            "description": "Time the action was initiated. The Timestamp is shown in ISO 8601 format and Coordinated Universal Time (UTC). For example, midnight UTC on Jan 1, 2014 appears as\u202f'2014-01-01T00:00:00Z'.",
            "format": "date-time",
            "nullable": true
          },
          "statusDetail": {
            "$ref": "#/components/schemas/microsoft.graph.cloudPcStatusDetail"
          },
          "statusDetails": {
            "$ref": "#/components/schemas/microsoft.graph.cloudPcStatusDetails"
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.cloudPcReviewStatus": {
        "title": "cloudPcReviewStatus",
        "type": "object",
        "properties": {
          "azureStorageAccountId": {
            "type": "string",
            "description": "The resource ID of the Azure Storage account in which the Cloud PC snapshot is being saved.",
            "nullable": true
          },
          "azureStorageAccountName": {
            "type": "string",
            "description": "The name of the Azure Storage account in which the Cloud PC snapshot is being saved.",
            "nullable": true
          },
          "azureStorageContainerName": {
            "type": "string",
            "description": "The name of the container in an Azure Storage account in which the Cloud PC snapshot is being saved.",
            "nullable": true
          },
          "inReview": {
            "type": "boolean",
            "description": "True if the Cloud PC is set to in review by the administrator."
          },
          "restorePointDateTime": {
            "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
            "type": "string",
            "description": "The specific date and time of the Cloud PC snapshot that was taken and saved automatically, when the Cloud PC is set to in review. The timestamp is shown in ISO 8601 format and Coordinated Universal Time (UTC). For example, midnight UTC on Jan 1, 2014 appears as 2014-01-01T00:00:00Z.",
            "format": "date-time",
            "nullable": true
          },
          "reviewStartDateTime": {
            "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
            "type": "string",
            "description": "The specific date and time when the Cloud PC was set to in review. The timestamp is shown in ISO 8601 format and Coordinated Universal Time (UTC). For example, midnight UTC on Jan 1, 2014 appears as 2014-01-01T00:00:00Z.",
            "format": "date-time",
            "nullable": true
          },
          "subscriptionId": {
            "type": "string",
            "description": "The ID of the Azure subscription in which the Cloud PC snapshot is being saved, in GUID format.",
            "nullable": true
          },
          "subscriptionName": {
            "type": "string",
            "description": "The name of the Azure subscription in which the Cloud PC snapshot is being saved.",
            "nullable": true
          },
          "userAccessLevel": {
            "$ref": "#/components/schemas/microsoft.graph.cloudPcUserAccessLevel"
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.deviceCompliancePolicySettingState": {
        "title": "deviceCompliancePolicySettingState",
        "type": "object",
        "properties": {
          "currentValue": {
            "type": "string",
            "description": "Current value of setting on device",
            "nullable": true
          },
          "errorCode": {
            "type": "integer",
            "description": "Error code for the setting",
            "format": "int64"
          },
          "errorDescription": {
            "type": "string",
            "description": "Error description",
            "nullable": true
          },
          "instanceDisplayName": {
            "type": "string",
            "description": "Name of setting instance that is being reported.",
            "nullable": true
          },
          "setting": {
            "type": "string",
            "description": "The setting that is being reported",
            "nullable": true
          },
          "settingInstanceId": {
            "type": "string",
            "description": "SettingInstanceId",
            "nullable": true
          },
          "settingName": {
            "type": "string",
            "description": "Localized/user friendly setting name that is being reported",
            "nullable": true
          },
          "sources": {
            "type": "array",
            "items": {
              "$ref": "#/components/schemas/microsoft.graph.settingSource"
            },
            "description": "Contributing policies"
          },
          "state": {
            "$ref": "#/components/schemas/microsoft.graph.complianceStatus"
          },
          "userEmail": {
            "type": "string",
            "description": "UserEmail",
            "nullable": true
          },
          "userId": {
            "type": "string",
            "description": "UserId",
            "nullable": true
          },
          "userName": {
            "type": "string",
            "description": "UserName",
            "nullable": true
          },
          "userPrincipalName": {
            "type": "string",
            "description": "UserPrincipalName.",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Device Compilance Policy Setting State for a given device."
      },
      "microsoft.graph.powerliftIncidentMetadata": {
        "title": "powerliftIncidentMetadata",
        "type": "object",
        "properties": {
          "application": {
            "type": "string",
            "description": "The name of the application the diagnostic is from. Example: com.microsoft.CompanyPortal",
            "nullable": true
          },
          "clientVersion": {
            "type": "string",
            "description": "The version of the application. Example: 5.2203.1",
            "nullable": true
          },
          "createdAtDateTime": {
            "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
            "type": "string",
            "description": "The time the app diagnostic was created. Example: 2022-04-19T17:24:45.313Z",
            "format": "date-time",
            "nullable": true
          },
          "easyId": {
            "type": "string",
            "description": "The unique app diagnostic identifier as a user friendly 8 character hexadecimal string. Example: 8520467A",
            "nullable": true
          },
          "fileNames": {
            "type": "array",
            "items": {
              "type": "string",
              "nullable": true
            },
            "description": "A list of files that are associated with the diagnostic."
          },
          "locale": {
            "type": "string",
            "description": "The locale information of the application. Example: en-US",
            "nullable": true
          },
          "platform": {
            "type": "string",
            "description": "The device's OS the diagnostic is from. Example: iOS",
            "nullable": true
          },
          "powerliftId": {
            "pattern": "^[0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}$",
            "type": "string",
            "description": "The unique identifier of the app diagnostic. Example: 8520467a-49a9-44a4-8447-8dfb8bec6726",
            "format": "uuid"
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Collection of app diagnostics associated with a user."
      },
      "microsoft.graph.configManagerPolicySummary": {
        "title": "configManagerPolicySummary",
        "type": "object",
        "properties": {
          "compliantDeviceCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The number of devices evaluated to be compliant by the policy.",
            "format": "int32"
          },
          "enforcedDeviceCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The number of devices that have have been remediated by the policy.",
            "format": "int32"
          },
          "failedDeviceCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The number of devices that failed to be evaluated by the policy.",
            "format": "int32"
          },
          "nonCompliantDeviceCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The number of devices evaluated to be noncompliant by the policy.",
            "format": "int32"
          },
          "pendingDeviceCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The number of devices that have acknowledged the policy but are pending evaluation.",
            "format": "int32"
          },
          "targetedDeviceCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The number of devices targeted by the policy.",
            "format": "int32"
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "A ConfigManager policy summary."
      },
      "microsoft.graph.deviceManagementConfigurationPolicy": {
        "allOf": [
          {
            "$ref": "#/components/schemas/microsoft.graph.entity"
          },
          {
            "title": "deviceManagementConfigurationPolicy",
            "type": "object",
            "properties": {
              "createdDateTime": {
                "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
                "type": "string",
                "description": "Policy creation date and time",
                "format": "date-time"
              },
              "creationSource": {
                "type": "string",
                "description": "Policy creation source",
                "nullable": true
              },
              "description": {
                "type": "string",
                "description": "Policy description",
                "nullable": true
              },
              "isAssigned": {
                "type": "boolean",
                "description": "Policy assignment status. This property is read-only.",
                "readOnly": true
              },
              "lastModifiedDateTime": {
                "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
                "type": "string",
                "description": "Policy last modification date and time",
                "format": "date-time"
              },
              "name": {
                "type": "string",
                "description": "Policy name",
                "nullable": true
              },
              "platforms": {
                "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationPlatforms"
              },
              "priorityMetaData": {
                "$ref": "#/components/schemas/microsoft.graph.deviceManagementPriorityMetaData"
              },
              "roleScopeTagIds": {
                "type": "array",
                "items": {
                  "type": "string",
                  "nullable": true
                },
                "description": "List of Scope Tags for this Entity instance."
              },
              "settingCount": {
                "maximum": 2147483647,
                "minimum": -2147483648,
                "type": "integer",
                "description": "Number of settings",
                "format": "int32"
              },
              "technologies": {
                "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationTechnologies"
              },
              "templateReference": {
                "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationPolicyTemplateReference"
              },
              "assignments": {
                "type": "array",
                "items": {
                  "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationPolicyAssignment"
                },
                "description": "Policy assignments",
                "x-ms-navigationProperty": true
              },
              "settings": {
                "type": "array",
                "items": {
                  "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationSetting"
                },
                "description": "Policy settings",
                "x-ms-navigationProperty": true
              }
            },
            "additionalProperties": {
              "type": "object"
            },
            "description": "Device Management Configuration Policy"
          }
        ]
      },
      "microsoft.graph.retireScheduledManagedDevice": {
        "title": "retireScheduledManagedDevice",
        "type": "object",
        "properties": {
          "complianceState": {
            "$ref": "#/components/schemas/microsoft.graph.complianceStatus"
          },
          "deviceCompliancePolicyId": {
            "type": "string",
            "description": "Device Compliance PolicyId",
            "nullable": true
          },
          "deviceCompliancePolicyName": {
            "type": "string",
            "description": "Device Compliance Policy Name",
            "nullable": true
          },
          "deviceType": {
            "$ref": "#/components/schemas/microsoft.graph.deviceType"
          },
          "id": {
            "type": "string",
            "description": "Key of the entity.",
            "nullable": true
          },
          "managedDeviceId": {
            "type": "string",
            "description": "Managed DeviceId",
            "nullable": true
          },
          "managedDeviceName": {
            "type": "string",
            "description": "Managed Device Name",
            "nullable": true
          },
          "managementAgent": {
            "$ref": "#/components/schemas/microsoft.graph.managementAgentType"
          },
          "ownerType": {
            "$ref": "#/components/schemas/microsoft.graph.managedDeviceOwnerType"
          },
          "retireAfterDateTime": {
            "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
            "type": "string",
            "description": "Managed Device Retire After DateTime",
            "format": "date-time"
          },
          "roleScopeTagIds": {
            "type": "array",
            "items": {
              "type": "string",
              "nullable": true
            },
            "description": "List of Scope Tags for this Entity instance."
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "ManagedDevices that are scheduled for retire"
      },
      "microsoft.graph.iosAvailableUpdateVersion": {
        "title": "iosAvailableUpdateVersion",
        "type": "object",
        "properties": {
          "expirationDateTime": {
            "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
            "type": "string",
            "description": "The expiration date of the update.",
            "format": "date-time"
          },
          "postingDateTime": {
            "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
            "type": "string",
            "description": "The posting date of the update.",
            "format": "date-time"
          },
          "productVersion": {
            "type": "string",
            "description": "The version of the update."
          },
          "supportedDevices": {
            "type": "array",
            "items": {
              "type": "string",
              "nullable": true
            },
            "description": "List of supported devices for the update."
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "iOS available update version details"
      },
      "microsoft.graph.deviceHealthScriptRemediationHistory": {
        "title": "deviceHealthScriptRemediationHistory",
        "type": "object",
        "properties": {
          "historyData": {
            "type": "array",
            "items": {
              "$ref": "#/components/schemas/microsoft.graph.deviceHealthScriptRemediationHistoryData"
            },
            "description": "The number of devices remediated by the device health script on the given date."
          },
          "lastModifiedDateTime": {
            "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
            "type": "string",
            "description": "The date on which the results history is calculated for the healthscript.",
            "format": "date-time",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "The number of devices remediated by a device health script on a given date with the last modified time."
      },
      "microsoft.graph.globalDeviceHealthScriptState": {
        "title": "globalDeviceHealthScriptState",
        "enum": [
          "notConfigured",
          "pending",
          "enabled"
        ],
        "type": "string",
        "description": "Indicates whether global device health scripts are enabled and are in which state",
        "x-ms-enum": {
          "name": "globalDeviceHealthScriptState",
          "modelAsString": false,
          "values": [
            {
              "value": "notConfigured",
              "description": "Global device health scripts are not configured",
              "name": "notConfigured"
            },
            {
              "value": "pending",
              "description": "Global device health scripts are configured but not fully enabled",
              "name": "pending"
            },
            {
              "value": "enabled",
              "description": "Global device health scripts are enabled and ready to use",
              "name": "enabled"
            }
          ]
        }
      },
      "microsoft.graph.deviceHealthScriptRemediationSummary": {
        "title": "deviceHealthScriptRemediationSummary",
        "type": "object",
        "properties": {
          "remediatedDeviceCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The number of devices remediated by device health scripts.",
            "format": "int32",
            "nullable": true
          },
          "scriptCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The number of device health scripts deployed.",
            "format": "int32",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "The number of device health scripts deployed and the number of devices the scripts remediated."
      },
      "microsoft.graph.deviceManagementSettingComparison": {
        "title": "deviceManagementSettingComparison",
        "type": "object",
        "properties": {
          "comparisonResult": {
            "$ref": "#/components/schemas/microsoft.graph.deviceManagementComparisonResult"
          },
          "currentValueJson": {
            "type": "string",
            "description": "JSON representation of current intent (or) template setting's value",
            "nullable": true
          },
          "definitionId": {
            "type": "string",
            "description": "The ID of the setting definition for this instance",
            "nullable": true
          },
          "displayName": {
            "type": "string",
            "description": "The setting's display name",
            "nullable": true
          },
          "id": {
            "type": "string",
            "description": "The setting ID",
            "nullable": true
          },
          "newValueJson": {
            "type": "string",
            "description": "JSON representation of new template setting's value",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Entity representing setting comparison result"
      },
      "microsoft.graph.deviceManagementIntentCustomizedSetting": {
        "title": "deviceManagementIntentCustomizedSetting",
        "type": "object",
        "properties": {
          "customizedJson": {
            "type": "string",
            "description": "JSON representation of the customized value, if different from default",
            "nullable": true
          },
          "defaultJson": {
            "type": "string",
            "description": "JSON representation of the default value from the template",
            "nullable": true
          },
          "definitionId": {
            "type": "string",
            "description": "The ID of the setting definition for this setting",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Default and customized value of a setting in a Security Baseline"
      },
      "microsoft.graph.managedDeviceWindowsOperatingSystemImage": {
        "allOf": [
          {
            "$ref": "#/components/schemas/microsoft.graph.entity"
          },
          {
            "title": "managedDeviceWindowsOperatingSystemImage",
            "type": "object",
            "properties": {
              "availableUpdates": {
                "type": "array",
                "items": {
                  "$ref": "#/components/schemas/microsoft.graph.managedDeviceWindowsOperatingSystemUpdate"
                },
                "description": "Indicates the available Quality/Security updates for a specific Windows product version (example: Windows 11 22H1), for upto last 3 Patch Tuesdays . This value in the API response would be updated 2-3 days after every Patch Tuesday. Supports: $filter, $select, $top, $skip. Read-only."
              },
              "supportedArchitectures": {
                "type": "array",
                "items": {
                  "$ref": "#/components/schemas/microsoft.graph.managedDeviceArchitecture"
                },
                "description": "Indicates the list of architectures supported by the image. E.g. ['ARM64','X86']. Supports: $filter, $select, $top, $skip. Read-only."
              },
              "supportedEditions": {
                "type": "array",
                "items": {
                  "$ref": "#/components/schemas/microsoft.graph.managedDeviceWindowsOperatingSystemEdition"
                },
                "description": "Indicates the list of editions supported by the image along with their support dates. Supports: $filter, $select, $top, $skip. Read-only."
              }
            },
            "additionalProperties": {
              "type": "object"
            },
            "description": "This entity defines different Windows Operating System products, like 'Windows 11 22H1', 'Windows 11 22H2' etc., along with their available configurations."
          }
        ]
      },
      "microsoft.graph.deviceAndAppManagementAssignedRoleDetails": {
        "title": "deviceAndAppManagementAssignedRoleDetails",
        "type": "object",
        "properties": {
          "roleAssignmentIds": {
            "type": "array",
            "items": {
              "type": "string",
              "nullable": true
            },
            "description": "Role Assignment IDs for the specifc Role Assignments assigned to a user. This property is read-only.",
            "readOnly": true
          },
          "roleDefinitionIds": {
            "type": "array",
            "items": {
              "type": "string",
              "nullable": true
            },
            "description": "Role Definition IDs for the specifc Role Definitions assigned to a user. This property is read-only.",
            "readOnly": true
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "The set of Role Definitions and Role Assignments assigned to a user."
      },
      "microsoft.graph.comanagedDevicesSummary": {
        "title": "comanagedDevicesSummary",
        "type": "object",
        "properties": {
          "compliancePolicyCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Number of devices with CompliancePolicy swung-over. This property is read-only.",
            "format": "int32",
            "readOnly": true
          },
          "configurationSettingsCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Number of devices with ConfigurationSettings swung-over. This property is read-only.",
            "format": "int32",
            "readOnly": true
          },
          "endpointProtectionCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Number of devices with EndpointProtection swung-over. This property is read-only.",
            "format": "int32",
            "readOnly": true
          },
          "inventoryCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Number of devices with Inventory swung-over. This property is read-only.",
            "format": "int32",
            "readOnly": true
          },
          "modernAppsCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Number of devices with ModernApps swung-over. This property is read-only.",
            "format": "int32",
            "readOnly": true
          },
          "officeAppsCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Number of devices with OfficeApps swung-over. This property is read-only.",
            "format": "int32",
            "readOnly": true
          },
          "resourceAccessCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Number of devices with ResourceAccess swung-over. This property is read-only.",
            "format": "int32",
            "readOnly": true
          },
          "totalComanagedCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Number of Co-Managed Devices. This property is read-only.",
            "format": "int32",
            "readOnly": true
          },
          "windowsUpdateForBusinessCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Number of devices with WindowsUpdateForBusiness swung-over. This property is read-only.",
            "format": "int32",
            "readOnly": true
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Summary data for co managed devices"
      },
      "microsoft.graph.comanagementEligibleDevicesSummary": {
        "title": "comanagementEligibleDevicesSummary",
        "type": "object",
        "properties": {
          "comanagedCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Count of devices already Co-Managed",
            "format": "int32"
          },
          "eligibleButNotAzureAdJoinedCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Count of devices eligible for Co-Management but not yet joined to Azure Active Directory",
            "format": "int32"
          },
          "eligibleCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Count of devices fully eligible for Co-Management",
            "format": "int32"
          },
          "ineligibleCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Count of devices ineligible for Co-Management",
            "format": "int32"
          },
          "needsOsUpdateCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Count of devices that will be eligible for Co-Management after an OS update",
            "format": "int32"
          },
          "scheduledForEnrollmentCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Count of devices scheduled for Co-Management enrollment. Valid values 0 to 9999999",
            "format": "int32"
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.rolePermission": {
        "title": "rolePermission",
        "type": "object",
        "properties": {
          "actions": {
            "type": "array",
            "items": {
              "type": "string",
              "nullable": true
            },
            "description": "Allowed Actions - Deprecated"
          },
          "resourceActions": {
            "type": "array",
            "items": {
              "$ref": "#/components/schemas/microsoft.graph.resourceAction"
            },
            "description": "Resource Actions each containing a set of allowed and not allowed permissions."
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Contains the set of ResourceActions determining the allowed and not allowed permissions for each role."
      },
      "microsoft.graph.roleScopeTag": {
        "allOf": [
          {
            "$ref": "#/components/schemas/microsoft.graph.entity"
          },
          {
            "title": "roleScopeTag",
            "type": "object",
            "properties": {
              "description": {
                "type": "string",
                "description": "Description of the Role Scope Tag.",
                "nullable": true
              },
              "displayName": {
                "type": "string",
                "description": "The display or friendly name of the Role Scope Tag.",
                "nullable": true
              },
              "isBuiltIn": {
                "type": "boolean",
                "description": "Description of the Role Scope Tag. This property is read-only.",
                "readOnly": true
              },
              "assignments": {
                "type": "array",
                "items": {
                  "$ref": "#/components/schemas/microsoft.graph.roleScopeTagAutoAssignment"
                },
                "description": "The list of assignments for this Role Scope Tag.",
                "x-ms-navigationProperty": true
              }
            },
            "additionalProperties": {
              "type": "object"
            },
            "description": "Role Scope Tag"
          }
        ]
      },
      "microsoft.graph.suggestedEnrollmentLimit": {
        "title": "suggestedEnrollmentLimit",
        "type": "object",
        "properties": {
          "suggestedDailyLimit": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The suggested enrollment limit within a day",
            "format": "int32"
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "The suggestedEnrollmentLimit resource represents the suggested enrollment limit when given an enrollment type."
      },
      "microsoft.graph.userExperienceAnalyticsDeviceScopeSummary": {
        "title": "userExperienceAnalyticsDeviceScopeSummary",
        "type": "object",
        "properties": {
          "completedDeviceScopeIds": {
            "type": "array",
            "items": {
              "type": "string",
              "nullable": true
            },
            "description": "A collection of the user experience analytics device scope Unique Identifiers that are enabled and finished recalculating the report metric."
          },
          "insufficientDataDeviceScopeIds": {
            "type": "array",
            "items": {
              "type": "string",
              "nullable": true
            },
            "description": "A collection of user experience analytics device scope Unique Identitfiers that are enabled but there is insufficient data to calculate results."
          },
          "totalDeviceScopes": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The total number of user experience analytics device scopes. Valid values -2147483648 to 2147483647",
            "format": "int32"
          },
          "totalDeviceScopesEnabled": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The total number of user experience analytics device scopes that are enabled. Valid values -2147483648 to 2147483647",
            "format": "int32"
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "The user experience analytics tenant level information for all the device scope configurations"
      },
      "microsoft.graph.userExperienceAnalyticsWorkFromAnywhereDevicesSummary": {
        "title": "userExperienceAnalyticsWorkFromAnywhereDevicesSummary",
        "type": "object",
        "properties": {
          "autopilotDevicesSummary": {
            "$ref": "#/components/schemas/microsoft.graph.userExperienceAnalyticsAutopilotDevicesSummary"
          },
          "cloudIdentityDevicesSummary": {
            "$ref": "#/components/schemas/microsoft.graph.userExperienceAnalyticsCloudIdentityDevicesSummary"
          },
          "cloudManagementDevicesSummary": {
            "$ref": "#/components/schemas/microsoft.graph.userExperienceAnalyticsCloudManagementDevicesSummary"
          },
          "coManagedDevices": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Total number of co-managed devices. Read-only. Valid values -2147483648 to 2147483647",
            "format": "int32"
          },
          "devicesNotAutopilotRegistered": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The count of intune devices that are not autopilot registerd. Read-only. Valid values -2147483648 to 2147483647",
            "format": "int32"
          },
          "devicesWithoutAutopilotProfileAssigned": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The count of intune devices not autopilot profile assigned. Read-only. Valid values -2147483648 to 2147483647",
            "format": "int32"
          },
          "devicesWithoutCloudIdentity": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The count of devices that are not cloud identity. Read-only. Valid values -2147483648 to 2147483647",
            "format": "int32"
          },
          "intuneDevices": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The count of intune devices that are not autopilot registerd. Read-only. Valid values -2147483648 to 2147483647",
            "format": "int32"
          },
          "tenantAttachDevices": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Total count of tenant attach devices. Read-only. Valid values -2147483648 to 2147483647",
            "format": "int32"
          },
          "totalDevices": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The total count of devices. Read-only. Valid values -2147483648 to 2147483647",
            "format": "int32"
          },
          "unsupportedOSversionDevices": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The count of Windows 10 devices that have unsupported OS versions. Read-only. Valid values -2147483648 to 2147483647",
            "format": "int32"
          },
          "windows10Devices": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The count of windows 10 devices. Read-only. Valid values -2147483648 to 2147483647",
            "format": "int32"
          },
          "windows10DevicesSummary": {
            "$ref": "#/components/schemas/microsoft.graph.userExperienceAnalyticsWindows10DevicesSummary"
          },
          "windows10DevicesWithoutTenantAttach": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The count of windows 10 devices that are Intune and co-managed. Read-only. Valid values -2147483648 to 2147483647",
            "format": "int32"
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "The user experience analytics Work From Anywhere metrics devices summary."
      },
      "microsoft.graph.deviceManagement.portalNotification": {
        "title": "portalNotification",
        "type": "object",
        "properties": {
          "alertImpact": {
            "$ref": "#/components/schemas/microsoft.graph.deviceManagement.alertImpact"
          },
          "alertRecordId": {
            "type": "string",
            "description": "The associated alert record ID.",
            "nullable": true
          },
          "alertRuleId": {
            "type": "string",
            "description": "The associated alert rule ID.",
            "nullable": true
          },
          "alertRuleName": {
            "type": "string",
            "description": "The associated alert rule name.",
            "nullable": true
          },
          "alertRuleTemplate": {
            "$ref": "#/components/schemas/microsoft.graph.deviceManagement.alertRuleTemplate"
          },
          "id": {
            "type": "string",
            "description": "The unique identifier for the portal notification.",
            "nullable": true
          },
          "isPortalNotificationSent": {
            "type": "boolean",
            "description": "true if the portal notification has already been sent to the user; false otherwise.",
            "nullable": true
          },
          "severity": {
            "$ref": "#/components/schemas/microsoft.graph.deviceManagement.ruleSeverityType"
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.operationApprovalPolicySet": {
        "title": "operationApprovalPolicySet",
        "type": "object",
        "properties": {
          "policyPlatform": {
            "$ref": "#/components/schemas/microsoft.graph.operationApprovalPolicyPlatform"
          },
          "policyType": {
            "$ref": "#/components/schemas/microsoft.graph.operationApprovalPolicyType"
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Contains the pair of OperationApprovalPolicyType and OperationApprovalPolicyPlatform determining the set of applicable OperationApprovalPolicies for a user. The OperationApprovalPolicySet complex type is used to indicate to the UX which policies are enabled for the current logged in user in order to correctly show the expected experience."
      },
      "microsoft.graph.operationApprovalRequest": {
        "allOf": [
          {
            "$ref": "#/components/schemas/microsoft.graph.entity"
          },
          {
            "title": "operationApprovalRequest",
            "type": "object",
            "properties": {
              "approvalJustification": {
                "type": "string",
                "description": "Indicates the justification for approving or rejecting the request. Maximum length of justification is 1024 characters. For example: 'Approved per Change 23423 - needed for Feb 2023 application baseline updates.' Read-only. This property is read-only.",
                "nullable": true,
                "readOnly": true
              },
              "approver": {
                "$ref": "#/components/schemas/microsoft.graph.identitySet"
              },
              "expirationDateTime": {
                "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
                "type": "string",
                "description": "Indicates the DateTime when any action on the approval request is no longer permitted. The value cannot be modified and is automatically populated when the request is created using expiration offset values defined in the service controllers. The Timestamp type represents date and time information using ISO 8601 format and is always in UTC time. For example, midnight UTC on Jan 1, 2014 would look like this: '2014-01-01T00:00:00Z'. Returned by default. Read-only. This property is read-only.",
                "format": "date-time",
                "readOnly": true
              },
              "lastModifiedDateTime": {
                "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
                "type": "string",
                "description": "Indicates the last DateTime that the request was modified. The value cannot be modified and is automatically populated whenever values in the request are updated. For example, when the 'status' property changes from needsApproval to approved. The Timestamp type represents date and time information using ISO 8601 format and is always in UTC time. For example, midnight UTC on Jan 1, 2014 would look like this: '2014-01-01T00:00:00Z'. Returned by default. Read-only. This property is read-only.",
                "format": "date-time",
                "readOnly": true
              },
              "requestDateTime": {
                "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
                "type": "string",
                "description": "Indicates the DateTime that the request was made. The value cannot be modified and is automatically populated when the request is created. The Timestamp type represents date and time information using ISO 8601 format and is always in UTC time. For example, midnight UTC on Jan 1, 2014 would look like this: '2014-01-01T00:00:00Z'. Returned by default. Read-only. This property is read-only.",
                "format": "date-time",
                "readOnly": true
              },
              "requestJustification": {
                "type": "string",
                "description": "Indicates the justification for creating the request. Maximum length of justification is 1024 characters. For example: 'Needed for Feb 2023 application baseline updates.' Read-only. This property is read-only.",
                "nullable": true,
                "readOnly": true
              },
              "requestor": {
                "$ref": "#/components/schemas/microsoft.graph.identitySet"
              },
              "requiredOperationApprovalPolicyTypes": {
                "type": "array",
                "items": {
                  "$ref": "#/components/schemas/microsoft.graph.operationApprovalPolicyType"
                },
                "description": "Indicates the approval policy types required by the request in order for the request to be approved or rejected. Read-only. This property is read-only.",
                "readOnly": true
              },
              "status": {
                "$ref": "#/components/schemas/microsoft.graph.operationApprovalRequestStatus"
              }
            },
            "additionalProperties": {
              "type": "object"
            },
            "description": "The OperationApprovalRequest entity encompasses the operation an admin wishes to perform and is requesting approval to complete. It contains the detail of the operation one wishes to perform, user metadata of the requestor, and a justification for the change. It allows for several operations for both the requestor and the potential approver to either approve, deny, or cancel the request and a response justification to provide information for the decision."
          }
        ]
      },
      "microsoft.graph.tenantAttachRBACState": {
        "title": "tenantAttachRBACState",
        "type": "object",
        "properties": {
          "enabled": {
            "type": "boolean",
            "description": "Indicates whether the tenant is enabled for Tenant Attach with role management.  TRUE if enabled, FALSE if the Tenant Attach with rolemanagement is disabled."
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Represents result of GetState API."
      },
      "microsoft.graph.userExperienceAnalyticsSummarizedBy": {
        "title": "userExperienceAnalyticsSummarizedBy",
        "enum": [
          "none",
          "model",
          "allRegressions",
          "modelRegression",
          "manufacturerRegression",
          "operatingSystemVersionRegression",
          "unknownFutureValue"
        ],
        "type": "string",
        "description": "Indicates type of summarization. Possible values are: None, Model, AllRegressions, ModelRegression, ManufacturerRegression, OperatingSystemVersionRegression.",
        "x-ms-enum": {
          "name": "userExperienceAnalyticsSummarizedBy",
          "modelAsString": false,
          "values": [
            {
              "value": "none",
              "description": "Indicates that the summarization is none.",
              "name": "none"
            },
            {
              "value": "model",
              "description": "Indicates that the summarization is by model.",
              "name": "model"
            },
            {
              "value": "allRegressions",
              "description": "Indicates that the summarization is by all regressions.",
              "name": "allRegressions"
            },
            {
              "value": "modelRegression",
              "description": "Indicates that the summarization is by model regression.",
              "name": "modelRegression"
            },
            {
              "value": "manufacturerRegression",
              "description": "Indicates that the summarization is by manufacturer regression.",
              "name": "manufacturerRegression"
            },
            {
              "value": "operatingSystemVersionRegression",
              "description": "Indicates that the summarization is by operating system version regression.",
              "name": "operatingSystemVersionRegression"
            },
            {
              "value": "unknownFutureValue",
              "description": "Evolvable enumeration sentinel value. Do not use.",
              "name": "unknownFutureValue"
            }
          ]
        }
      },
      "microsoft.graph.userExperienceAnalyticsDevicePerformance": {
        "allOf": [
          {
            "$ref": "#/components/schemas/microsoft.graph.entity"
          },
          {
            "title": "userExperienceAnalyticsDevicePerformance",
            "type": "object",
            "properties": {
              "averageBlueScreens": {
                "type": "number",
                "description": "Average (mean) number of Blue Screens per device in the last 30 days. Valid values 0 to 9999999",
                "format": "double"
              },
              "averageRestarts": {
                "type": "number",
                "description": "Average (mean) number of Restarts per device in the last 30 days. Valid values 0 to 9999999",
                "format": "double"
              },
              "blueScreenCount": {
                "maximum": 2147483647,
                "minimum": -2147483648,
                "type": "integer",
                "description": "Number of Blue Screens in the last 30 days. Valid values 0 to 9999999",
                "format": "int32"
              },
              "bootScore": {
                "maximum": 2147483647,
                "minimum": -2147483648,
                "type": "integer",
                "description": "The user experience analytics device boot score.",
                "format": "int32"
              },
              "coreBootTimeInMs": {
                "maximum": 2147483647,
                "minimum": -2147483648,
                "type": "integer",
                "description": "The user experience analytics device core boot time in milliseconds.",
                "format": "int32"
              },
              "coreLoginTimeInMs": {
                "maximum": 2147483647,
                "minimum": -2147483648,
                "type": "integer",
                "description": "The user experience analytics device core login time in milliseconds.",
                "format": "int32"
              },
              "deviceCount": {
                "type": "integer",
                "description": "User experience analytics summarized device count.",
                "format": "int64"
              },
              "deviceName": {
                "type": "string",
                "description": "The user experience analytics device name.",
                "nullable": true
              },
              "diskType": {
                "$ref": "#/components/schemas/microsoft.graph.diskType"
              },
              "groupPolicyBootTimeInMs": {
                "maximum": 2147483647,
                "minimum": -2147483648,
                "type": "integer",
                "description": "The user experience analytics device group policy boot time in milliseconds.",
                "format": "int32"
              },
              "groupPolicyLoginTimeInMs": {
                "maximum": 2147483647,
                "minimum": -2147483648,
                "type": "integer",
                "description": "The user experience analytics device group policy login time in milliseconds.",
                "format": "int32"
              },
              "healthStatus": {
                "$ref": "#/components/schemas/microsoft.graph.userExperienceAnalyticsHealthState"
              },
              "loginScore": {
                "maximum": 2147483647,
                "minimum": -2147483648,
                "type": "integer",
                "description": "The user experience analytics device login score.",
                "format": "int32"
              },
              "manufacturer": {
                "type": "string",
                "description": "The user experience analytics device manufacturer.",
                "nullable": true
              },
              "model": {
                "type": "string",
                "description": "The user experience analytics device model.",
                "nullable": true
              },
              "modelStartupPerformanceScore": {
                "type": "number",
                "description": "The user experience analytics model level startup performance score. Valid values -1.79769313486232E+308 to 1.79769313486232E+308",
                "format": "double"
              },
              "operatingSystemVersion": {
                "type": "string",
                "description": "The user experience analytics device Operating System version.",
                "nullable": true
              },
              "responsiveDesktopTimeInMs": {
                "maximum": 2147483647,
                "minimum": -2147483648,
                "type": "integer",
                "description": "The user experience analytics responsive desktop time in milliseconds.",
                "format": "int32"
              },
              "restartCount": {
                "maximum": 2147483647,
                "minimum": -2147483648,
                "type": "integer",
                "description": "Number of Restarts in the last 30 days. Valid values 0 to 9999999",
                "format": "int32"
              },
              "startupPerformanceScore": {
                "type": "number",
                "description": "The user experience analytics device startup performance score. Valid values -1.79769313486232E+308 to 1.79769313486232E+308",
                "format": "double"
              }
            },
            "additionalProperties": {
              "type": "object"
            },
            "description": "The user experience analytics device performance entity contains device boot performance details."
          }
        ]
      },
      "microsoft.graph.userExperienceAnalyticsRemoteConnection": {
        "allOf": [
          {
            "$ref": "#/components/schemas/microsoft.graph.entity"
          },
          {
            "title": "userExperienceAnalyticsRemoteConnection",
            "type": "object",
            "properties": {
              "cloudPcFailurePercentage": {
                "type": "number",
                "description": "The sign in failure percentage of Cloud PC Device. Valid values 0 to 100",
                "format": "double"
              },
              "cloudPcRoundTripTime": {
                "type": "number",
                "description": "The round tip time of Cloud PC Device. Valid values 0 to 1.79769313486232E+308",
                "format": "double"
              },
              "cloudPcSignInTime": {
                "type": "number",
                "description": "The sign in time of Cloud PC Device. Valid values 0 to 1.79769313486232E+308",
                "format": "double"
              },
              "coreBootTime": {
                "type": "number",
                "description": "The core boot time of Cloud PC Device. Valid values 0 to 1.79769313486232E+308",
                "format": "double"
              },
              "coreSignInTime": {
                "type": "number",
                "description": "The core sign in time of Cloud PC Device. Valid values 0 to 1.79769313486232E+308",
                "format": "double"
              },
              "deviceCount": {
                "maximum": 2147483647,
                "minimum": -2147483648,
                "type": "integer",
                "description": "The count of remote connection. Valid values 0 to 2147483647",
                "format": "int32"
              },
              "deviceId": {
                "type": "string",
                "description": "The id of the device.",
                "nullable": true
              },
              "deviceName": {
                "type": "string",
                "description": "The name of the device.",
                "nullable": true
              },
              "manufacturer": {
                "type": "string",
                "description": "The user experience analytics manufacturer.",
                "nullable": true
              },
              "model": {
                "type": "string",
                "description": "The user experience analytics device model.",
                "nullable": true
              },
              "remoteSignInTime": {
                "type": "number",
                "description": "The remote sign in time of Cloud PC Device. Valid values 0 to 1.79769313486232E+308",
                "format": "double"
              },
              "userPrincipalName": {
                "type": "string",
                "description": "The user experience analytics userPrincipalName.",
                "nullable": true
              },
              "virtualNetwork": {
                "type": "string",
                "description": "The user experience analytics virtual network.",
                "nullable": true
              }
            },
            "additionalProperties": {
              "type": "object"
            },
            "description": "The user experience analytics remote connection entity. The report will be retired on December 31, 2024. You can start using the Cloud PC connection quality report now via https://go.microsoft.com/fwlink/?linkid=2283835."
          }
        ]
      },
      "microsoft.graph.userExperienceAnalyticsResourcePerformance": {
        "allOf": [
          {
            "$ref": "#/components/schemas/microsoft.graph.entity"
          },
          {
            "title": "userExperienceAnalyticsResourcePerformance",
            "type": "object",
            "properties": {
              "averageSpikeTimeScore": {
                "maximum": 2147483647,
                "minimum": -2147483648,
                "type": "integer",
                "description": "AverageSpikeTimeScore of a device or a model type. Valid values 0 to 100",
                "format": "int32"
              },
              "cpuClockSpeedInMHz": {
                "type": "number",
                "description": "The clock speed of the processor, in MHz. Valid values 0 to 1000000",
                "format": "double"
              },
              "cpuDisplayName": {
                "type": "string",
                "description": "The name of the processor on the device, For example, 11th Gen Intel(R) Core(TM) i7.",
                "nullable": true
              },
              "cpuSpikeTimePercentage": {
                "type": "number",
                "description": "CPU spike time in percentage. Valid values 0 to 100",
                "format": "double"
              },
              "cpuSpikeTimePercentageThreshold": {
                "type": "number",
                "description": "Threshold of cpuSpikeTimeScore. Valid values 0 to 100",
                "format": "double"
              },
              "cpuSpikeTimeScore": {
                "maximum": 2147483647,
                "minimum": -2147483648,
                "type": "integer",
                "description": "The user experience analytics device CPU spike time score. Valid values 0 to 100",
                "format": "int32"
              },
              "deviceCount": {
                "type": "integer",
                "description": "User experience analytics summarized device count.",
                "format": "int64"
              },
              "deviceId": {
                "type": "string",
                "description": "The id of the device.",
                "nullable": true
              },
              "deviceName": {
                "type": "string",
                "description": "The name of the device.",
                "nullable": true
              },
              "deviceResourcePerformanceScore": {
                "maximum": 2147483647,
                "minimum": -2147483648,
                "type": "integer",
                "description": "Resource performance score of a specific device. Valid values 0 to 100",
                "format": "int32"
              },
              "diskType": {
                "$ref": "#/components/schemas/microsoft.graph.diskType"
              },
              "healthStatus": {
                "$ref": "#/components/schemas/microsoft.graph.userExperienceAnalyticsHealthState"
              },
              "machineType": {
                "$ref": "#/components/schemas/microsoft.graph.userExperienceAnalyticsMachineType"
              },
              "manufacturer": {
                "type": "string",
                "description": "The user experience analytics device manufacturer.",
                "nullable": true
              },
              "model": {
                "type": "string",
                "description": "The user experience analytics device model.",
                "nullable": true
              },
              "ramSpikeTimePercentage": {
                "type": "number",
                "description": "RAM spike time in percentage. Valid values 0 to 100",
                "format": "double"
              },
              "ramSpikeTimePercentageThreshold": {
                "type": "number",
                "description": "Threshold of ramSpikeTimeScore. Valid values 0 to 100",
                "format": "double"
              },
              "ramSpikeTimeScore": {
                "maximum": 2147483647,
                "minimum": -2147483648,
                "type": "integer",
                "description": "The user experience analytics device RAM spike time score. Valid values 0 to 100",
                "format": "int32"
              },
              "totalProcessorCoreCount": {
                "maximum": 2147483647,
                "minimum": -2147483648,
                "type": "integer",
                "description": "The count of cores of the processor of device. Valid values 0 to 512",
                "format": "int32"
              },
              "totalRamInMB": {
                "type": "number",
                "description": "The total RAM of the device, in MB. Valid values 0 to 1000000",
                "format": "double"
              }
            },
            "additionalProperties": {
              "type": "object"
            },
            "description": "The user experience analytics resource performance entity."
          }
        ]
      },
      "microsoft.graph.cloudPcConnectivityEvent": {
        "title": "cloudPcConnectivityEvent",
        "type": "object",
        "properties": {
          "eventDateTime": {
            "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
            "type": "string",
            "description": "Indicates the date and time when this event was created. The timestamp is shown in ISO 8601 format and Coordinated Universal Time (UTC). For example, midnight UTC on Jan 1, 2014 appears as 2014-01-01T00:00:00Z.",
            "format": "date-time"
          },
          "eventName": {
            "type": "string",
            "description": "Name of the event.",
            "nullable": true
          },
          "eventResult": {
            "$ref": "#/components/schemas/microsoft.graph.cloudPcConnectivityEventResult"
          },
          "eventType": {
            "$ref": "#/components/schemas/microsoft.graph.cloudPcConnectivityEventType"
          },
          "message": {
            "type": "string",
            "description": "Additional message for this event.",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.cloudPcLaunchInfo": {
        "title": "cloudPcLaunchInfo",
        "type": "object",
        "properties": {
          "cloudPcId": {
            "type": "string",
            "description": "The unique identifier of the Cloud PC.",
            "nullable": true
          },
          "cloudPcLaunchUrl": {
            "type": "string",
            "description": "The connect URL of the Cloud PC.",
            "nullable": true
          },
          "windows365SwitchCompatible": {
            "type": "boolean",
            "description": "Indicates whether the Cloud PC supports switch functionality. If the value is true, it supports switch functionality; otherwise,  false.",
            "nullable": true
          },
          "windows365SwitchNotCompatibleReason": {
            "type": "string",
            "description": "Indicates the reason the Cloud PC doesn't support switch. CPCOsVersionNotMeetRequirement indicates that the user needs to update their Cloud PC operation system version. CPCHardwareNotMeetRequirement indicates that the Cloud PC needs more CPU or RAM to support the functionality.",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.frontlineCloudPcAccessState": {
        "title": "frontlineCloudPcAccessState",
        "enum": [
          "unassigned",
          "noLicensesAvailable",
          "activationFailed",
          "active",
          "activating",
          "standbyMode",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.cloudPcRemoteActionCapability": {
        "title": "cloudPcRemoteActionCapability",
        "type": "object",
        "properties": {
          "actionCapability": {
            "$ref": "#/components/schemas/microsoft.graph.actionCapability"
          },
          "actionName": {
            "$ref": "#/components/schemas/microsoft.graph.cloudPcRemoteActionName"
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.cloudPcSnapshot": {
        "allOf": [
          {
            "$ref": "#/components/schemas/microsoft.graph.entity"
          },
          {
            "title": "cloudPcSnapshot",
            "type": "object",
            "properties": {
              "cloudPcId": {
                "type": "string",
                "description": "The unique identifier for the Cloud PC."
              },
              "createdDateTime": {
                "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
                "type": "string",
                "description": "The date and time at which the snapshot was taken. The timestamp is shown in ISO 8601 format and Coordinated Universal Time (UTC). For example, midnight UTC on Jan 1, 2014 is 2014-01-01T00:00:00Z.",
                "format": "date-time",
                "nullable": true
              },
              "expirationDateTime": {
                "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
                "type": "string",
                "description": "The date and time when the snapshot expires. The time is shown in ISO 8601 format and Coordinated Universal Time (UTC) time. For example, midnight UTC on Jan 1, 2014 is 2014-01-01T00:00:00Z.",
                "format": "date-time",
                "nullable": true
              },
              "lastRestoredDateTime": {
                "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
                "type": "string",
                "description": "The date and time at which the snapshot was last used to restore the Cloud PC device. The timestamp is shown in ISO 8601 format and Coordinated Universal Time (UTC). For example, midnight UTC on Jan 1, 2014 is 2014-01-01T00:00:00Z.",
                "format": "date-time",
                "nullable": true
              },
              "snapshotType": {
                "$ref": "#/components/schemas/microsoft.graph.cloudPcSnapshotType"
              },
              "status": {
                "$ref": "#/components/schemas/microsoft.graph.cloudPcSnapshotStatus"
              }
            },
            "additionalProperties": {
              "type": "object"
            }
          }
        ]
      },
      "microsoft.graph.cloudPC": {
        "allOf": [
          {
            "$ref": "#/components/schemas/microsoft.graph.entity"
          },
          {
            "title": "cloudPC",
            "type": "object",
            "properties": {
              "aadDeviceId": {
                "type": "string",
                "description": "The Microsoft Entra device ID of the Cloud PC.",
                "nullable": true
              },
              "allotmentDisplayName": {
                "type": "string",
                "description": "The allotment name divides tenant licenses into smaller batches or groups that help restrict the number of licenses available for use in a specific assignment. When the provisioningType is dedicated, the allotment name is null. Read-only.",
                "nullable": true
              },
              "connectionSetting": {
                "$ref": "#/components/schemas/microsoft.graph.cloudPcConnectionSetting"
              },
              "connectionSettings": {
                "$ref": "#/components/schemas/microsoft.graph.cloudPcConnectionSettings"
              },
              "connectivityResult": {
                "$ref": "#/components/schemas/microsoft.graph.cloudPcConnectivityResult"
              },
              "deviceRegionName": {
                "type": "string",
                "description": "The name of the geographical region where the Cloud PC is currently provisioned. For example, westus3, eastus2, and southeastasia. Read-only.",
                "nullable": true
              },
              "disasterRecoveryCapability": {
                "$ref": "#/components/schemas/microsoft.graph.cloudPcDisasterRecoveryCapability"
              },
              "diskEncryptionState": {
                "$ref": "#/components/schemas/microsoft.graph.cloudPcDiskEncryptionState"
              },
              "displayName": {
                "type": "string",
                "description": "The display name of the Cloud PC.",
                "nullable": true
              },
              "gracePeriodEndDateTime": {
                "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
                "type": "string",
                "description": "The date and time when the grace period ends and reprovisioning or deprovisioning happens. Required only if the status is inGracePeriod. The timestamp is shown in ISO 8601 format and Coordinated Universal Time (UTC). For example, midnight UTC on Jan 1, 2014 is 2014-01-01T00:00:00Z.",
                "format": "date-time",
                "nullable": true
              },
              "imageDisplayName": {
                "type": "string",
                "description": "Name of the OS image that's on the Cloud PC.",
                "nullable": true
              },
              "lastLoginResult": {
                "$ref": "#/components/schemas/microsoft.graph.cloudPcLoginResult"
              },
              "lastModifiedDateTime": {
                "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
                "type": "string",
                "description": "The last modified date and time of the Cloud PC. The Timestamp type represents date and time information using ISO 8601 format and is always in UTC time. For example, midnight UTC on Jan 1, 2014, is 2014-01-01T00:00:00Z.",
                "format": "date-time"
              },
              "lastRemoteActionResult": {
                "$ref": "#/components/schemas/microsoft.graph.cloudPcRemoteActionResult"
              },
              "managedDeviceId": {
                "type": "string",
                "description": "The Intune device ID of the Cloud PC.",
                "nullable": true
              },
              "managedDeviceName": {
                "type": "string",
                "description": "The Intune device name of the Cloud PC.",
                "nullable": true
              },
              "onPremisesConnectionName": {
                "type": "string",
                "description": "The Azure network connection that is applied during the provisioning of Cloud PCs.",
                "nullable": true
              },
              "osVersion": {
                "$ref": "#/components/schemas/microsoft.graph.cloudPcOperatingSystem"
              },
              "partnerAgentInstallResults": {
                "type": "array",
                "items": {
                  "$ref": "#/components/schemas/microsoft.graph.cloudPcPartnerAgentInstallResult"
                },
                "description": "The results of every partner agent's installation status on Cloud PC."
              },
              "powerState": {
                "$ref": "#/components/schemas/microsoft.graph.cloudPcPowerState"
              },
              "provisioningPolicyId": {
                "type": "string",
                "description": "The provisioning policy ID of the Cloud PC.",
                "nullable": true
              },
              "provisioningPolicyName": {
                "type": "string",
                "description": "The provisioning policy that is applied during the provisioning of Cloud PCs.",
                "nullable": true
              },
              "provisioningType": {
                "$ref": "#/components/schemas/microsoft.graph.cloudPcProvisioningType"
              },
              "scopeIds": {
                "type": "array",
                "items": {
                  "type": "string",
                  "nullable": true
                }
              },
              "servicePlanId": {
                "type": "string",
                "description": "The service plan ID of the Cloud PC.",
                "nullable": true
              },
              "servicePlanName": {
                "type": "string",
                "description": "The service plan name of the Cloud PC.",
                "nullable": true
              },
              "servicePlanType": {
                "$ref": "#/components/schemas/microsoft.graph.cloudPcServicePlanType"
              },
              "status": {
                "$ref": "#/components/schemas/microsoft.graph.cloudPcStatus"
              },
              "statusDetail": {
                "$ref": "#/components/schemas/microsoft.graph.cloudPcStatusDetail"
              },
              "statusDetails": {
                "$ref": "#/components/schemas/microsoft.graph.cloudPcStatusDetails"
              },
              "userAccountType": {
                "$ref": "#/components/schemas/microsoft.graph.cloudPcUserAccountType"
              },
              "userPrincipalName": {
                "type": "string",
                "description": "The user principal name (UPN) of the user assigned to the Cloud PC.",
                "nullable": true
              }
            },
            "additionalProperties": {
              "type": "object"
            }
          }
        ]
      },
      "microsoft.graph.cloudPcSourceDeviceImage": {
        "title": "cloudPcSourceDeviceImage",
        "type": "object",
        "properties": {
          "displayName": {
            "type": "string",
            "description": "The display name for the source image. Read-only.",
            "nullable": true
          },
          "id": {
            "type": "string",
            "description": "The unique identifier (ID) of the source image. Read-only. The id property is deprecated and will stop returning data on January 31, 2024. Going forward, use the resourceId property.",
            "nullable": true
          },
          "resourceId": {
            "type": "string",
            "description": "The fully qualified unique identifier (ID) of the source image resource in Azure. The ID format is: '/subscriptions/{subscription-id}/resourceGroups/{resourceGroupName}/providers/Microsoft.Compute/images/{imageName}'. Read-only."
          },
          "subscriptionDisplayName": {
            "type": "string",
            "description": "The display name of the subscription that hosts the source image. Read-only.",
            "nullable": true
          },
          "subscriptionId": {
            "type": "string",
            "description": "The unique identifier (ID) of the subscription that hosts the source image. Read-only.",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.cloudPcScopedPermission": {
        "title": "cloudPcScopedPermission",
        "type": "object",
        "properties": {
          "permission": {
            "type": "string",
            "description": "The operations allowed on scoped resources for the authenticated user. Example permission is Microsoft.CloudPC/ProvisioningPolicies/Create.",
            "nullable": true
          },
          "scopeIds": {
            "type": "array",
            "items": {
              "type": "string",
              "nullable": true
            },
            "description": "The scope IDs of corresponding permission. Currently, it's Intune scope tag ID."
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.cloudPcTenantEncryptionSetting": {
        "title": "cloudPcTenantEncryptionSetting",
        "type": "object",
        "properties": {
          "lastSyncDateTime": {
            "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
            "type": "string",
            "description": "Indicates the date and time when last sync tenant encryption setting.",
            "format": "date-time",
            "nullable": true
          },
          "tenantDiskEncryptionType": {
            "$ref": "#/components/schemas/microsoft.graph.cloudPcDiskEncryptionType"
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.cloudPcForensicStorageAccount": {
        "allOf": [
          {
            "$ref": "#/components/schemas/microsoft.graph.entity"
          },
          {
            "title": "cloudPcForensicStorageAccount",
            "type": "object",
            "properties": {
              "storageAccountId": {
                "type": "string",
                "description": "The ID of the storage account.",
                "nullable": true
              },
              "storageAccountName": {
                "type": "string",
                "description": "The name of the storage account.",
                "nullable": true
              }
            },
            "additionalProperties": {
              "type": "object"
            }
          }
        ]
      },
      "microsoft.graph.cloudPcSubscription": {
        "allOf": [
          {
            "$ref": "#/components/schemas/microsoft.graph.entity"
          },
          {
            "title": "cloudPcSubscription",
            "type": "object",
            "properties": {
              "subscriptionId": {
                "type": "string",
                "description": "The ID of the subscription.",
                "nullable": true
              },
              "subscriptionName": {
                "type": "string",
                "description": "The name of the subscription.",
                "nullable": true
              }
            },
            "additionalProperties": {
              "type": "object"
            }
          }
        ]
      },
      "microsoft.graph.assignmentFilterOperator": {
        "title": "assignmentFilterOperator",
        "enum": [
          "notSet",
          "equals",
          "notEquals",
          "startsWith",
          "notStartsWith",
          "contains",
          "notContains",
          "in",
          "notIn",
          "endsWith",
          "notEndsWith",
          "greaterThan",
          "greaterThanOrEquals",
          "lessThan",
          "lessThanOrEquals",
          "unknownFutureValue"
        ],
        "type": "string",
        "description": "Represents the different type of operators which can be used to craft the AssignmentFilter rule.",
        "x-ms-enum": {
          "name": "assignmentFilterOperator",
          "modelAsString": false,
          "values": [
            {
              "value": "notSet",
              "description": "Indicates operator is not set",
              "name": "notSet"
            },
            {
              "value": "equals",
              "description": "Indicates the devices whose property value equals the configured input in Assignment Filters.",
              "name": "equals"
            },
            {
              "value": "notEquals",
              "description": "Indicates the devices whose property value not equals the configured input in Assignment Filters.",
              "name": "notEquals"
            },
            {
              "value": "startsWith",
              "description": "Indicates the devices whose property value starts with the configured input in Assignment Filters.",
              "name": "startsWith"
            },
            {
              "value": "notStartsWith",
              "description": "Indicates the devices whose property value does not start with the configured input in Assignment Filters.",
              "name": "notStartsWith"
            },
            {
              "value": "contains",
              "description": "Indicates the devices whose property value contains the configured input in Assignment Filters.",
              "name": "contains"
            },
            {
              "value": "notContains",
              "description": "Indicates the devices whose property value does not contain the configured input in Assignment Filters.",
              "name": "notContains"
            },
            {
              "value": "in",
              "description": "Indicates the devices whose property value equals one of the configured input in Assignment Filters.",
              "name": "in"
            },
            {
              "value": "notIn",
              "description": "Indicates the devices whose property value does not equals any of the configured input in Assignment Filters.",
              "name": "notIn"
            },
            {
              "value": "endsWith",
              "description": "Indicates the devices whose property value ends with the configured input in Assignment Filters.",
              "name": "endsWith"
            },
            {
              "value": "notEndsWith",
              "description": "Indicates the devices whose property value does not end with the configured input in Assignment Filters.",
              "name": "notEndsWith"
            },
            {
              "value": "greaterThan",
              "description": "Indicates the devices whose property value is greater than the configured input in Assignment Filters.",
              "name": "greaterThan"
            },
            {
              "value": "greaterThanOrEquals",
              "description": "`Indicates the devices whose property value is greater than or equal to the configured input in Assignment Filters.",
              "name": "greaterThanOrEquals"
            },
            {
              "value": "lessThan",
              "description": "Indicates the devices whose property value is less than the configured input in Assignment Filters.",
              "name": "lessThan"
            },
            {
              "value": "lessThanOrEquals",
              "description": "Indicates the devices whose property value is less than or equal to the configured input in Assignment Filters.",
              "name": "lessThanOrEquals"
            },
            {
              "value": "unknownFutureValue",
              "description": "Evolvable enumeration sentinel value. Do not use.",
              "name": "unknownFutureValue"
            }
          ]
        }
      },
      "microsoft.graph.actionState": {
        "title": "actionState",
        "enum": [
          "none",
          "pending",
          "canceled",
          "active",
          "done",
          "failed",
          "notSupported"
        ],
        "type": "string"
      },
      "microsoft.graph.cloudPcStatusDetail": {
        "title": "cloudPcStatusDetail",
        "type": "object",
        "properties": {
          "additionalInformation": {
            "type": "array",
            "items": {
              "$ref": "#/components/schemas/microsoft.graph.keyValuePair"
            },
            "description": "More information about the Cloud PC status. For example, 'additionalInformation': ['{'@odata.type': 'microsoft.graph.keyValuePair','name': 'retriable','value': true }] '"
          },
          "code": {
            "type": "string",
            "description": "The error/warning code associated with the Cloud PC status. Example: 'code': 'internalServerError'.",
            "nullable": true
          },
          "message": {
            "type": "string",
            "description": "The status message associated with error code. Example: 'message': 'There was an internal server error. Please contact support xxx.'.",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.cloudPcStatusDetails": {
        "title": "cloudPcStatusDetails",
        "type": "object",
        "properties": {
          "additionalInformation": {
            "type": "array",
            "items": {
              "$ref": "#/components/schemas/microsoft.graph.keyValuePair"
            },
            "description": "Any additional information about the Cloud PC status."
          },
          "code": {
            "type": "string",
            "description": "The code associated with the Cloud PC status.",
            "nullable": true
          },
          "message": {
            "type": "string",
            "description": "The status message.",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.cloudPcUserAccessLevel": {
        "title": "cloudPcUserAccessLevel",
        "enum": [
          "unrestricted",
          "restricted",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.settingSource": {
        "title": "settingSource",
        "type": "object",
        "properties": {
          "displayName": {
            "type": "string",
            "nullable": true
          },
          "id": {
            "type": "string",
            "nullable": true
          },
          "sourceType": {
            "$ref": "#/components/schemas/microsoft.graph.settingSourceType"
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.complianceStatus": {
        "title": "complianceStatus",
        "enum": [
          "unknown",
          "notApplicable",
          "compliant",
          "remediated",
          "nonCompliant",
          "error",
          "conflict",
          "notAssigned"
        ],
        "type": "string"
      },
      "microsoft.graph.entity": {
        "title": "entity",
        "type": "object",
        "properties": {
          "id": {
            "type": "string",
            "description": "The unique identifier for an entity. Read-only."
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.deviceManagementConfigurationPlatforms": {
        "title": "deviceManagementConfigurationPlatforms",
        "enum": [
          "none",
          "android",
          "iOS",
          "macOS",
          "windows10X",
          "windows10",
          "linux",
          "unknownFutureValue"
        ],
        "type": "string",
        "description": "Supported platform types.",
        "x-ms-enum-flags": {
          "isFlags": true
        },
        "x-ms-enum": {
          "name": "deviceManagementConfigurationPlatforms",
          "modelAsString": false,
          "values": [
            {
              "value": "none",
              "description": "Indicates the settings contained in this configuration don't have a platform set.",
              "name": "none"
            },
            {
              "value": "android",
              "description": "Indicates that the settings contained in associated configuration applies to the Android operating system. ",
              "name": "android"
            },
            {
              "value": "iOS",
              "description": "Indicates that the settings contained in associated configuration applies to the iOS operating system.",
              "name": "iOS"
            },
            {
              "value": "macOS",
              "description": "Indicates that the settings contained in associated configuration applies to the MacOS operating system.",
              "name": "macOS"
            },
            {
              "value": "windows10X",
              "description": "Indicates that the settings contained in associated configuration applies to the Windows 10X operating system.",
              "name": "windows10X"
            },
            {
              "value": "windows10",
              "description": "Indicates that the settings contained in associated configuration applies to the Windows 10 operating system.",
              "name": "windows10"
            },
            {
              "value": "linux",
              "description": "Indicates that the settings contained in associated configuration applies to the Linux operating system.",
              "name": "linux"
            },
            {
              "value": "unknownFutureValue",
              "description": "Evolvable enumeration sentinel value. Do not use.",
              "name": "unknownFutureValue"
            }
          ]
        }
      },
      "microsoft.graph.deviceManagementPriorityMetaData": {
        "title": "deviceManagementPriorityMetaData",
        "type": "object",
        "properties": {
          "priority": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Priority of the policy. Valid values 1 to 500",
            "format": "int32"
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Priority metadata of the policy."
      },
      "microsoft.graph.deviceManagementConfigurationTechnologies": {
        "title": "deviceManagementConfigurationTechnologies",
        "enum": [
          "none",
          "mdm",
          "windows10XManagement",
          "configManager",
          "appleRemoteManagement",
          "microsoftSense",
          "exchangeOnline",
          "mobileApplicationManagement",
          "linuxMdm",
          "enrollment",
          "endpointPrivilegeManagement",
          "unknownFutureValue",
          "windowsOsRecovery"
        ],
        "type": "string",
        "description": "Describes which technology this setting can be deployed with",
        "x-ms-enum-flags": {
          "isFlags": true
        },
        "x-ms-enum": {
          "name": "deviceManagementConfigurationTechnologies",
          "modelAsString": false,
          "values": [
            {
              "value": "none",
              "description": "Default. Setting cannot be deployed through any channel.",
              "name": "none"
            },
            {
              "value": "mdm",
              "description": "Setting can be deployed through the MDM channel.",
              "name": "mdm"
            },
            {
              "value": "windows10XManagement",
              "description": "Setting can be deployed through the Windows10XManagement channel",
              "name": "windows10XManagement"
            },
            {
              "value": "configManager",
              "description": "Setting can be deployed through the ConfigManager channel.",
              "name": "configManager"
            },
            {
              "value": "appleRemoteManagement",
              "description": "Setting can be deployed through the AppleRemoteManagement channel.",
              "name": "appleRemoteManagement"
            },
            {
              "value": "microsoftSense",
              "description": "Setting can be deployed through the SENSE agent channel.",
              "name": "microsoftSense"
            },
            {
              "value": "exchangeOnline",
              "description": "Setting can be deployed through the Exchange Online agent channel.",
              "name": "exchangeOnline"
            },
            {
              "value": "mobileApplicationManagement",
              "description": "Setting can be deployed through the Mobile Application Management (MAM) channel",
              "name": "mobileApplicationManagement"
            },
            {
              "value": "linuxMdm",
              "description": "Setting can be deployed through the Linux Mdm channel.",
              "name": "linuxMdm"
            },
            {
              "value": "enrollment",
              "description": "Setting can be deployed through device enrollment.",
              "name": "enrollment"
            },
            {
              "value": "endpointPrivilegeManagement",
              "description": "Setting can be deployed using the Endpoint privilege management channel",
              "name": "endpointPrivilegeManagement"
            },
            {
              "value": "unknownFutureValue",
              "description": "Evolvable enumeration sentinel value. Do not use.",
              "name": "unknownFutureValue"
            },
            {
              "value": "windowsOsRecovery",
              "description": "Setting can be deployed using the Operating System Recovery channel",
              "name": "windowsOsRecovery"
            }
          ]
        }
      },
      "microsoft.graph.deviceManagementConfigurationPolicyTemplateReference": {
        "title": "deviceManagementConfigurationPolicyTemplateReference",
        "type": "object",
        "properties": {
          "templateDisplayName": {
            "type": "string",
            "description": "Template Display Name of the referenced template. This property is read-only.",
            "nullable": true,
            "readOnly": true
          },
          "templateDisplayVersion": {
            "type": "string",
            "description": "Template Display Version of the referenced Template. This property is read-only.",
            "nullable": true,
            "readOnly": true
          },
          "templateFamily": {
            "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationTemplateFamily"
          },
          "templateId": {
            "type": "string",
            "description": "Template id",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Policy template reference information"
      },
      "microsoft.graph.deviceManagementConfigurationPolicyAssignment": {
        "allOf": [
          {
            "$ref": "#/components/schemas/microsoft.graph.entity"
          },
          {
            "title": "deviceManagementConfigurationPolicyAssignment",
            "type": "object",
            "properties": {
              "source": {
                "$ref": "#/components/schemas/microsoft.graph.deviceAndAppManagementAssignmentSource"
              },
              "sourceId": {
                "type": "string",
                "description": "The identifier of the source of the assignment.",
                "nullable": true
              },
              "target": {
                "$ref": "#/components/schemas/microsoft.graph.deviceAndAppManagementAssignmentTarget"
              }
            },
            "additionalProperties": {
              "type": "object"
            },
            "description": "The DeviceManagementConfigurationPolicyAssignment entity assigns a specific DeviceManagementConfigurationPolicy to an AAD group."
          }
        ]
      },
      "microsoft.graph.deviceManagementConfigurationSetting": {
        "allOf": [
          {
            "$ref": "#/components/schemas/microsoft.graph.entity"
          },
          {
            "title": "deviceManagementConfigurationSetting",
            "type": "object",
            "properties": {
              "settingInstance": {
                "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationSettingInstance"
              },
              "settingDefinitions": {
                "type": "array",
                "items": {
                  "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationSettingDefinition"
                },
                "description": "List of related Setting Definitions. This property is read-only.",
                "x-ms-navigationProperty": true
              }
            },
            "additionalProperties": {
              "type": "object"
            },
            "description": "Setting instance within policy"
          }
        ]
      },
      "microsoft.graph.deviceType": {
        "title": "deviceType",
        "enum": [
          "desktop",
          "windowsRT",
          "winMO6",
          "nokia",
          "windowsPhone",
          "mac",
          "winCE",
          "winEmbedded",
          "iPhone",
          "iPad",
          "iPod",
          "android",
          "iSocConsumer",
          "unix",
          "macMDM",
          "holoLens",
          "surfaceHub",
          "androidForWork",
          "androidEnterprise",
          "windows10x",
          "androidnGMS",
          "chromeOS",
          "linux",
          "blackberry",
          "palm",
          "unknown",
          "cloudPC"
        ],
        "type": "string",
        "description": "Device type.",
        "x-ms-enum": {
          "name": "deviceType",
          "modelAsString": false,
          "values": [
            {
              "value": "desktop",
              "description": "Desktop.",
              "name": "desktop"
            },
            {
              "value": "windowsRT",
              "description": "WindowsRT.",
              "name": "windowsRT"
            },
            {
              "value": "winMO6",
              "description": "WinMO6.",
              "name": "winMO6"
            },
            {
              "value": "nokia",
              "description": "Nokia.",
              "name": "nokia"
            },
            {
              "value": "windowsPhone",
              "description": "Windows phone.",
              "name": "windowsPhone"
            },
            {
              "value": "mac",
              "description": "Mac.",
              "name": "mac"
            },
            {
              "value": "winCE",
              "description": "WinCE.",
              "name": "winCE"
            },
            {
              "value": "winEmbedded",
              "description": "WinEmbedded.",
              "name": "winEmbedded"
            },
            {
              "value": "iPhone",
              "description": "iPhone.",
              "name": "iPhone"
            },
            {
              "value": "iPad",
              "description": "iPad.",
              "name": "iPad"
            },
            {
              "value": "iPod",
              "description": "iPodTouch.",
              "name": "iPod"
            },
            {
              "value": "android",
              "description": "Android.",
              "name": "android"
            },
            {
              "value": "iSocConsumer",
              "description": "iSocConsumer.",
              "name": "iSocConsumer"
            },
            {
              "value": "unix",
              "description": "Unix.",
              "name": "unix"
            },
            {
              "value": "macMDM",
              "description": "Mac OS X client using built in MDM agent.",
              "name": "macMDM"
            },
            {
              "value": "holoLens",
              "description": "Representing the fancy Windows 10 goggles.",
              "name": "holoLens"
            },
            {
              "value": "surfaceHub",
              "description": "Surface HUB device.",
              "name": "surfaceHub"
            },
            {
              "value": "androidForWork",
              "description": "Android for work device.",
              "name": "androidForWork"
            },
            {
              "value": "androidEnterprise",
              "description": "Android enterprise device.",
              "name": "androidEnterprise"
            },
            {
              "value": "windows10x",
              "description": "Windows 10x device.",
              "name": "windows10x"
            },
            {
              "value": "androidnGMS",
              "description": "Android non Google managed device.",
              "name": "androidnGMS"
            },
            {
              "value": "chromeOS",
              "description": "ChromeOS device.",
              "name": "chromeOS"
            },
            {
              "value": "linux",
              "description": "Linux device.",
              "name": "linux"
            },
            {
              "value": "blackberry",
              "description": "Blackberry.",
              "name": "blackberry"
            },
            {
              "value": "palm",
              "description": "Palm.",
              "name": "palm"
            },
            {
              "value": "unknown",
              "description": "Represents that the device type is unknown.",
              "name": "unknown"
            },
            {
              "value": "cloudPC",
              "description": "Cloud PC device.",
              "name": "cloudPC"
            }
          ]
        }
      },
      "microsoft.graph.managementAgentType": {
        "title": "managementAgentType",
        "enum": [
          "eas",
          "mdm",
          "easMdm",
          "intuneClient",
          "easIntuneClient",
          "configurationManagerClient",
          "configurationManagerClientMdm",
          "configurationManagerClientMdmEas",
          "unknown",
          "jamf",
          "googleCloudDevicePolicyController",
          "microsoft365ManagedMdm",
          "msSense",
          "intuneAosp",
          "google",
          "unknownFutureValue"
        ],
        "type": "string",
        "description": "Management agent type.",
        "x-ms-enum": {
          "name": "managementAgentType",
          "modelAsString": false,
          "values": [
            {
              "value": "eas",
              "description": "The device is managed by Exchange server.",
              "name": "eas"
            },
            {
              "value": "mdm",
              "description": "The device is managed by Intune MDM.",
              "name": "mdm"
            },
            {
              "value": "easMdm",
              "description": "The device is managed by both Exchange server and Intune MDM.",
              "name": "easMdm"
            },
            {
              "value": "intuneClient",
              "description": "Intune client managed.",
              "name": "intuneClient"
            },
            {
              "value": "easIntuneClient",
              "description": "The device is EAS and Intune client dual managed.",
              "name": "easIntuneClient"
            },
            {
              "value": "configurationManagerClient",
              "description": "The device is managed by Configuration Manager.",
              "name": "configurationManagerClient"
            },
            {
              "value": "configurationManagerClientMdm",
              "description": "The device is managed by Configuration Manager and MDM.",
              "name": "configurationManagerClientMdm"
            },
            {
              "value": "configurationManagerClientMdmEas",
              "description": "The device is managed by Configuration Manager, MDM and Eas.",
              "name": "configurationManagerClientMdmEas"
            },
            {
              "value": "unknown",
              "description": "Unknown management agent type.",
              "name": "unknown"
            },
            {
              "value": "jamf",
              "description": "The device attributes are fetched from Jamf.",
              "name": "jamf"
            },
            {
              "value": "googleCloudDevicePolicyController",
              "description": "The device is managed by Google's CloudDPC.",
              "name": "googleCloudDevicePolicyController"
            },
            {
              "value": "microsoft365ManagedMdm",
              "description": "This device is managed by Microsoft 365 through Intune.",
              "name": "microsoft365ManagedMdm"
            },
            {
              "value": "intuneAosp",
              "description": "This device is managed by Intune's MDM for AOSP (Android Open Source Project) devices",
              "name": "intuneAosp"
            },
            {
              "value": "google",
              "description": "Indicates the management agent to manage the device is Google.",
              "name": "google"
            },
            {
              "value": "unknownFutureValue",
              "description": "Evolvable enumeration sentinel value. Do not use.",
              "name": "unknownFutureValue"
            }
          ]
        }
      },
      "microsoft.graph.managedDeviceOwnerType": {
        "title": "managedDeviceOwnerType",
        "enum": [
          "unknown",
          "company",
          "personal"
        ],
        "type": "string",
        "description": "Owner type of device.",
        "x-ms-enum": {
          "name": "managedDeviceOwnerType",
          "modelAsString": false,
          "values": [
            {
              "value": "unknown",
              "description": "Unknown.",
              "name": "unknown"
            },
            {
              "value": "company",
              "description": "Owned by company.",
              "name": "company"
            },
            {
              "value": "personal",
              "description": "Owned by person.",
              "name": "personal"
            }
          ]
        }
      },
      "microsoft.graph.deviceHealthScriptRemediationHistoryData": {
        "title": "deviceHealthScriptRemediationHistoryData",
        "type": "object",
        "properties": {
          "date": {
            "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])$",
            "type": "string",
            "description": "The date on which devices were remediated by the device health script.",
            "format": "date"
          },
          "detectFailedDeviceCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The number of devices for which the detection script found an issue.",
            "format": "int32"
          },
          "noIssueDeviceCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The number of devices that were found to have no issue by the device health script.",
            "format": "int32"
          },
          "remediatedDeviceCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The number of devices remediated by the device health script.",
            "format": "int32"
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "The number of devices remediated by a device health script on a given date."
      },
      "microsoft.graph.deviceManagementComparisonResult": {
        "title": "deviceManagementComparisonResult",
        "enum": [
          "unknown",
          "equal",
          "notEqual",
          "added",
          "removed"
        ],
        "type": "string",
        "description": "Setting comparison result type",
        "x-ms-enum": {
          "name": "deviceManagementComparisonResult",
          "modelAsString": false,
          "values": [
            {
              "value": "unknown",
              "description": "Unknown setting comparison",
              "name": "unknown"
            },
            {
              "value": "equal",
              "description": "The setting values are equal",
              "name": "equal"
            },
            {
              "value": "notEqual",
              "description": "The setting values are not equal",
              "name": "notEqual"
            },
            {
              "value": "added",
              "description": "The setting is added",
              "name": "added"
            },
            {
              "value": "removed",
              "description": "The setting is removed",
              "name": "removed"
            }
          ]
        }
      },
      "microsoft.graph.managedDeviceWindowsOperatingSystemUpdate": {
        "title": "managedDeviceWindowsOperatingSystemUpdate",
        "type": "object",
        "properties": {
          "buildVersion": {
            "type": "string",
            "description": "Indicates the build version for associated windows update. Windows Operating System updates are usually released on the Patch Tuesday or B-week of each month. Read-only."
          },
          "releaseMonth": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Indicates the Month in which this B-week update was released. Read-only.",
            "format": "int32"
          },
          "releaseYear": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Indicates the Year in which this B-week update was released. Read-only.",
            "format": "int32"
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Updates for different Windows' versions are usually released on the Patch Tuesday or B-week  of each month. This complex type defines the Build-version and the release-date for a particular B-week update of the Windows' version."
      },
      "microsoft.graph.managedDeviceArchitecture": {
        "title": "managedDeviceArchitecture",
        "enum": [
          "unknown",
          "x86",
          "x64",
          "arm",
          "arM64"
        ],
        "type": "string",
        "description": "Processor architecture",
        "x-ms-enum": {
          "name": "managedDeviceArchitecture",
          "modelAsString": false,
          "values": [
            {
              "value": "unknown",
              "description": "Unknown architecture",
              "name": "unknown"
            },
            {
              "value": "x86",
              "description": "X86",
              "name": "x86"
            },
            {
              "value": "x64",
              "description": "X64",
              "name": "x64"
            },
            {
              "value": "arm",
              "description": "ARM",
              "name": "arm"
            },
            {
              "value": "arM64",
              "description": "ARM64",
              "name": "arM64"
            }
          ]
        }
      },
      "microsoft.graph.managedDeviceWindowsOperatingSystemEdition": {
        "title": "managedDeviceWindowsOperatingSystemEdition",
        "type": "object",
        "properties": {
          "editionType": {
            "$ref": "#/components/schemas/microsoft.graph.managedDeviceWindowsOperatingSystemEditionType"
          },
          "supportEndDate": {
            "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])$",
            "type": "string",
            "description": "Indicates the Date until which this Operating System edition type is officially supported. The Timestamp type represents date and time information using ISO 8601 format and is always in Pacific Time Zone (PT). For example, 2014-01-01 would mean '2014-01-01T07:00:00Z' in UTC time. Returned by default. Read-only.",
            "format": "date"
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Different Windows' versions have Edition specific support timelines. This complex type defines the date until which a particular edition is supported in a Windows' version."
      },
      "microsoft.graph.resourceAction": {
        "title": "resourceAction",
        "type": "object",
        "properties": {
          "allowedResourceActions": {
            "type": "array",
            "items": {
              "type": "string",
              "nullable": true
            },
            "description": "Allowed Actions"
          },
          "notAllowedResourceActions": {
            "type": "array",
            "items": {
              "type": "string",
              "nullable": true
            },
            "description": "Not Allowed Actions."
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Set of allowed and not allowed actions for a resource."
      },
      "microsoft.graph.roleScopeTagAutoAssignment": {
        "allOf": [
          {
            "$ref": "#/components/schemas/microsoft.graph.entity"
          },
          {
            "title": "roleScopeTagAutoAssignment",
            "type": "object",
            "properties": {
              "target": {
                "$ref": "#/components/schemas/microsoft.graph.deviceAndAppManagementAssignmentTarget"
              }
            },
            "additionalProperties": {
              "type": "object"
            },
            "description": "Contains the properties for auto-assigning a Role Scope Tag to a group to be applied to Devices."
          }
        ]
      },
      "microsoft.graph.userExperienceAnalyticsAutopilotDevicesSummary": {
        "title": "userExperienceAnalyticsAutopilotDevicesSummary",
        "type": "object",
        "properties": {
          "devicesNotAutopilotRegistered": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The count of intune devices that are not autopilot registerd. Read-only.",
            "format": "int32"
          },
          "devicesWithoutAutopilotProfileAssigned": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The count of intune devices not autopilot profile assigned. Read-only.",
            "format": "int32"
          },
          "totalWindows10DevicesWithoutTenantAttached": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The count of windows 10 devices that are Intune and co-managed. Read-only.",
            "format": "int32"
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "The user experience analytics summary of Devices not windows autopilot ready."
      },
      "microsoft.graph.userExperienceAnalyticsCloudIdentityDevicesSummary": {
        "title": "userExperienceAnalyticsCloudIdentityDevicesSummary",
        "type": "object",
        "properties": {
          "deviceWithoutCloudIdentityCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The count of devices that are not cloud identity. Read-only.",
            "format": "int32"
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "The user experience analytics work from anywhere cloud identity devices summary."
      },
      "microsoft.graph.userExperienceAnalyticsCloudManagementDevicesSummary": {
        "title": "userExperienceAnalyticsCloudManagementDevicesSummary",
        "type": "object",
        "properties": {
          "coManagedDeviceCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Total number of  co-managed devices. Read-only.",
            "format": "int32"
          },
          "intuneDeviceCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The count of intune devices that are not autopilot registerd. Read-only.",
            "format": "int32"
          },
          "tenantAttachDeviceCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Total count of tenant attach devices. Read-only.",
            "format": "int32"
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "The user experience work from anywhere Cloud management devices summary."
      },
      "microsoft.graph.userExperienceAnalyticsWindows10DevicesSummary": {
        "title": "userExperienceAnalyticsWindows10DevicesSummary",
        "type": "object",
        "properties": {
          "unsupportedOSversionDeviceCount": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The count of Windows 10 devices that have unsupported OS versions. Read-only.",
            "format": "int32"
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "The user experience analytics work from anywhere Windows 10 devices summary."
      },
      "microsoft.graph.deviceManagement.alertImpact": {
        "title": "alertImpact",
        "type": "object",
        "properties": {
          "aggregationType": {
            "$ref": "#/components/schemas/microsoft.graph.deviceManagement.aggregationType"
          },
          "alertImpactDetails": {
            "type": "array",
            "items": {
              "$ref": "#/components/schemas/microsoft.graph.keyValuePair"
            },
            "description": "The detail information of the impact. For example, if the Frontline Cloud PCs near concurrency limit alert is triggered, the details contain the impacted Frontline license SKU name, such as Windows 365 Frontline 2 vCPU/8GB/128GB, and the corresponding impacted value."
          },
          "value": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "The number value of the impact. For the aggregation types of count and affectedCloudPcCount, the value indicates the number of affected instances. For example, 6 affectedCloudPcCount means that six Cloud PCs are affected. For the aggregation types of percentage and affectedCloudPcPercentage, the value indicates the percent of affected instances. For example, 12 affectedCloudPcPercentage means that 12% of Cloud PCs are affected.",
            "format": "int32",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.deviceManagement.alertRuleTemplate": {
        "title": "alertRuleTemplate",
        "enum": [
          "cloudPcProvisionScenario",
          "cloudPcImageUploadScenario",
          "cloudPcOnPremiseNetworkConnectionCheckScenario",
          "unknownFutureValue",
          "cloudPcInGracePeriodScenario",
          "cloudPcFrontlineInsufficientLicensesScenario",
          "cloudPcInaccessibleScenario"
        ],
        "type": "string"
      },
      "microsoft.graph.deviceManagement.ruleSeverityType": {
        "title": "ruleSeverityType",
        "enum": [
          "unknown",
          "informational",
          "warning",
          "critical",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.operationApprovalPolicyPlatform": {
        "title": "operationApprovalPolicyPlatform",
        "enum": [
          "notApplicable",
          "androidDeviceAdministrator",
          "androidEnterprise",
          "iOSiPadOS",
          "macOS",
          "windows10AndLater",
          "windows81AndLater",
          "windows10X",
          "unknownFutureValue"
        ],
        "type": "string",
        "description": "The set of available platforms for the OperationApprovalPolicy. Allows configuration of a policy to specific platform(s) for approval. If no specific platform is required or applicable, the platform is `notApplicable`.",
        "x-ms-enum-flags": {
          "isFlags": true
        },
        "x-ms-enum": {
          "name": "operationApprovalPolicyPlatform",
          "modelAsString": false,
          "values": [
            {
              "value": "notApplicable",
              "description": "Default. Indicates that a policy platform is not required for a chosen policy type.",
              "name": "notApplicable"
            },
            {
              "value": "androidDeviceAdministrator",
              "description": "Indicates that the configured policy platform is for Android Device Administrator.",
              "name": "androidDeviceAdministrator"
            },
            {
              "value": "androidEnterprise",
              "description": "Indicates that the configured policy platform is for Android Enterprise.",
              "name": "androidEnterprise"
            },
            {
              "value": "iOSiPadOS",
              "description": "Indicates that the configured policy platform is for iOS/iPadOS.",
              "name": "iOSiPadOS"
            },
            {
              "value": "macOS",
              "description": "Indicates that the configured policy platform is for macOS.",
              "name": "macOS"
            },
            {
              "value": "windows10AndLater",
              "description": "Indicates that the configured policy platform is for Windows 10 and later.",
              "name": "windows10AndLater"
            },
            {
              "value": "windows81AndLater",
              "description": "Indicates that the configured policy platform is for Windows 8.1 and later.",
              "name": "windows81AndLater"
            },
            {
              "value": "windows10X",
              "description": "Indicates that the configured policy platform is for Windows 10X.",
              "name": "windows10X"
            },
            {
              "value": "unknownFutureValue",
              "description": "Evolvable enumeration sentinel value. Do not use.",
              "name": "unknownFutureValue"
            }
          ]
        }
      },
      "microsoft.graph.operationApprovalPolicyType": {
        "title": "operationApprovalPolicyType",
        "enum": [
          "unknown",
          "app",
          "script",
          "unknownFutureValue"
        ],
        "type": "string",
        "description": "The set of available policy types that can be configured for approval. The policy type must always be defined in an OperationApprovalRequest.",
        "x-ms-enum": {
          "name": "operationApprovalPolicyType",
          "modelAsString": false,
          "values": [
            {
              "value": "unknown",
              "description": "Default. Indicates that the configured policy type is unknown. Not a valid policy type in an OperationApprovalPolicy.",
              "name": "unknown"
            },
            {
              "value": "app",
              "description": "Indicates that the configured policy type is an application type, such as mobile apps or built-in apps.",
              "name": "app"
            },
            {
              "value": "script",
              "description": "Indicates that the configured policy type is a script type, such as Powershell scripts or remediation scripts.",
              "name": "script"
            },
            {
              "value": "unknownFutureValue",
              "description": "Evolvable enumeration sentinel value. Do not use.",
              "name": "unknownFutureValue"
            }
          ]
        }
      },
      "microsoft.graph.identitySet": {
        "title": "identitySet",
        "type": "object",
        "properties": {
          "application": {
            "$ref": "#/components/schemas/microsoft.graph.identity"
          },
          "device": {
            "$ref": "#/components/schemas/microsoft.graph.identity"
          },
          "user": {
            "$ref": "#/components/schemas/microsoft.graph.identity"
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.operationApprovalRequestStatus": {
        "title": "operationApprovalRequestStatus",
        "enum": [
          "unknown",
          "needsApproval",
          "approved",
          "rejected",
          "cancelled",
          "completed",
          "expired",
          "unknownFutureValue"
        ],
        "type": "string",
        "description": "Indicates the status of the Approval Request. The status of a request will change when an action is successfully performed on it, such as when it is `approved` or `rejected`, or when the request's expiration DateTime passes and the result is `expired`.",
        "x-ms-enum": {
          "name": "operationApprovalRequestStatus",
          "modelAsString": false,
          "values": [
            {
              "value": "unknown",
              "description": "Default. Indicates that the request approval status is unknown, and that the status has not been assigned to the approval request.",
              "name": "unknown"
            },
            {
              "value": "needsApproval",
              "description": "Indicates that the approval request needs approval before the operation can be completed.",
              "name": "needsApproval"
            },
            {
              "value": "approved",
              "description": "Indicates that the approval request has been approved. The operation can now be completed.",
              "name": "approved"
            },
            {
              "value": "rejected",
              "description": "Indicates that the approval request has been rejected. No further action can be taken to complete the operation or to modify the request.",
              "name": "rejected"
            },
            {
              "value": "cancelled",
              "description": "Indicates that the approval request has been cancelled by the request's requestor. No further action can be taken to complete the operation or to modify the request.",
              "name": "cancelled"
            },
            {
              "value": "completed",
              "description": "Indicates that the approval request has been completed. This status is feature agnostic and does not indicate success or failure of the operation. No further action is necessary for the operation or to modify the request.",
              "name": "completed"
            },
            {
              "value": "expired",
              "description": "Indicates that the approval request has expired. No further action can be taken to complete the operation or to modify the request. A new approval request must be made and approved in order to complete the operation.",
              "name": "expired"
            },
            {
              "value": "unknownFutureValue",
              "description": "Evolvable enumeration sentinel value. Do not use.",
              "name": "unknownFutureValue"
            }
          ]
        }
      },
      "ReferenceNumeric": {
        "enum": [
          "-INF",
          "INF",
          "NaN"
        ]
      },
      "microsoft.graph.diskType": {
        "title": "diskType",
        "enum": [
          "unknown",
          "hdd",
          "ssd",
          "unknownFutureValue"
        ],
        "type": "string",
        "x-ms-enum": {
          "name": "diskType",
          "modelAsString": false,
          "values": [
            {
              "value": "unknown",
              "description": "Enum member for unknown or default diskType.",
              "name": "unknown"
            },
            {
              "value": "hdd",
              "description": "Enum member for HDD devices.",
              "name": "hdd"
            },
            {
              "value": "ssd",
              "description": "Enum member for SSD devices.",
              "name": "ssd"
            },
            {
              "value": "unknownFutureValue",
              "description": "Evolvable enumeration sentinel value.Do not use.",
              "name": "unknownFutureValue"
            }
          ]
        }
      },
      "microsoft.graph.userExperienceAnalyticsHealthState": {
        "title": "userExperienceAnalyticsHealthState",
        "enum": [
          "unknown",
          "insufficientData",
          "needsAttention",
          "meetingGoals",
          "unknownFutureValue"
        ],
        "type": "string",
        "x-ms-enum": {
          "name": "userExperienceAnalyticsHealthState",
          "modelAsString": false,
          "values": [
            {
              "value": "unknown",
              "description": "Indicates that the health state is unknown.",
              "name": "unknown"
            },
            {
              "value": "insufficientData",
              "description": "Indicates that the health state is insufficient data.",
              "name": "insufficientData"
            },
            {
              "value": "needsAttention",
              "description": "Indicates that the health state needs attention.",
              "name": "needsAttention"
            },
            {
              "value": "meetingGoals",
              "description": "Indicates that the health state is meeting goals.",
              "name": "meetingGoals"
            },
            {
              "value": "unknownFutureValue",
              "description": "Evolvable enumeration sentinel value. Do not use.",
              "name": "unknownFutureValue"
            }
          ]
        }
      },
      "microsoft.graph.userExperienceAnalyticsMachineType": {
        "title": "userExperienceAnalyticsMachineType",
        "enum": [
          "unknown",
          "physical",
          "virtual",
          "unknownFutureValue"
        ],
        "type": "string",
        "description": "Indicates if machine is physical or virtual. Possible values are: physical or virtual",
        "x-ms-enum": {
          "name": "userExperienceAnalyticsMachineType",
          "modelAsString": false,
          "values": [
            {
              "value": "unknown",
              "description": "Indicates that the type is unknown.",
              "name": "unknown"
            },
            {
              "value": "physical",
              "description": "Indicates that the Machine is physical.",
              "name": "physical"
            },
            {
              "value": "virtual",
              "description": "Indicates that the machine is virtual.",
              "name": "virtual"
            },
            {
              "value": "unknownFutureValue",
              "description": "Evolvable enumeration sentinel value. Do not use.",
              "name": "unknownFutureValue"
            }
          ]
        }
      },
      "microsoft.graph.cloudPcConnectivityEventResult": {
        "title": "cloudPcConnectivityEventResult",
        "enum": [
          "unknown",
          "success",
          "failure",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.cloudPcConnectivityEventType": {
        "title": "cloudPcConnectivityEventType",
        "enum": [
          "unknown",
          "userConnection",
          "userTroubleshooting",
          "deviceHealthCheck",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.actionCapability": {
        "title": "actionCapability",
        "enum": [
          "enabled",
          "disabled",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.cloudPcRemoteActionName": {
        "title": "cloudPcRemoteActionName",
        "enum": [
          "unknown",
          "restart",
          "rename",
          "resize",
          "restore",
          "reprovision",
          "changeUserAccountType",
          "troubleshoot",
          "placeUnderReview",
          "unknownFutureValue",
          "createSnapshot",
          "powerOn",
          "powerOff",
          "moveRegion"
        ],
        "type": "string"
      },
      "microsoft.graph.cloudPcSnapshotType": {
        "title": "cloudPcSnapshotType",
        "enum": [
          "automatic",
          "manual",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.cloudPcSnapshotStatus": {
        "title": "cloudPcSnapshotStatus",
        "enum": [
          "ready",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.cloudPcConnectionSetting": {
        "title": "cloudPcConnectionSetting",
        "type": "object",
        "properties": {
          "enableSingleSignOn": {
            "type": "boolean",
            "description": "Indicates whether single sign-on is enabled. The default value is false."
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.cloudPcConnectionSettings": {
        "title": "cloudPcConnectionSettings",
        "type": "object",
        "properties": {
          "enableSingleSignOn": {
            "type": "boolean"
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.cloudPcConnectivityResult": {
        "title": "cloudPcConnectivityResult",
        "type": "object",
        "properties": {
          "failedHealthCheckItems": {
            "type": "array",
            "items": {
              "$ref": "#/components/schemas/microsoft.graph.cloudPcHealthCheckItem"
            },
            "description": "A list of failed health check items. If the status property is available, this property is empty."
          },
          "lastModifiedDateTime": {
            "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
            "type": "string",
            "description": "The last modified time for connectivity status of the Cloud PC. The Timestamp type represents date and time information using ISO 8601 format and is always in UTC time. For example, midnight UTC on Jan 1, 2014 would look like this: 2014-01-01T00:00:00Z.",
            "format": "date-time",
            "nullable": true
          },
          "status": {
            "$ref": "#/components/schemas/microsoft.graph.cloudPcConnectivityStatus"
          },
          "updatedDateTime": {
            "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
            "type": "string",
            "description": "Datetime when the status was updated. This property is deprecated and will no longer be supported effective August 31, 2024. Use lastModifiedDateTime instead. Read-Only.",
            "format": "date-time"
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.cloudPcDisasterRecoveryCapability": {
        "title": "cloudPcDisasterRecoveryCapability",
        "type": "object",
        "properties": {
          "capabilityType": {
            "$ref": "#/components/schemas/microsoft.graph.cloudPcDisasterRecoveryCapabilityType"
          },
          "primaryRegion": {
            "type": "string",
            "description": "The primary and mainly used region where the Cloud PC is located.",
            "nullable": true
          },
          "secondaryRegion": {
            "type": "string",
            "description": "The secondary region to which the Cloud PC can be failed over during a regional outage.",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.cloudPcDiskEncryptionState": {
        "title": "cloudPcDiskEncryptionState",
        "enum": [
          "notAvailable",
          "notEncrypted",
          "encryptedUsingPlatformManagedKey",
          "encryptedUsingCustomerManagedKey",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.cloudPcLoginResult": {
        "title": "cloudPcLoginResult",
        "type": "object",
        "properties": {
          "time": {
            "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
            "type": "string",
            "description": "The time of the Cloud PC sign in action. The timestamp is shown in ISO 8601 format and Coordinated Universal Time (UTC). For example, midnight UTC on Jan 1, 2014 appears as '2014-01-01T00:00:00Z'. Read-only.",
            "format": "date-time",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.cloudPcOperatingSystem": {
        "title": "cloudPcOperatingSystem",
        "enum": [
          "windows10",
          "windows11",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.cloudPcPartnerAgentInstallResult": {
        "title": "cloudPcPartnerAgentInstallResult",
        "type": "object",
        "properties": {
          "errorMessage": {
            "type": "string",
            "description": "Contains a detailed error message when the partner agent installation failed.",
            "nullable": true
          },
          "installStatus": {
            "$ref": "#/components/schemas/microsoft.graph.cloudPcPartnerAgentInstallStatus"
          },
          "isThirdPartyPartner": {
            "type": "boolean",
            "description": "Indicates whether the partner agent is a third party. When true, the agent is a third-party (non-Microsoft) agent and when false, the agent is a Microsoft agent or isn't known.  The default value is false.",
            "nullable": true
          },
          "partnerAgentName": {
            "$ref": "#/components/schemas/microsoft.graph.cloudPcPartnerAgentName"
          },
          "retriable": {
            "type": "boolean",
            "description": "Indicates whether the partner agent installation should be retried. The default value is false.",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.cloudPcPowerState": {
        "title": "cloudPcPowerState",
        "enum": [
          "running",
          "poweredOff",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.cloudPcProvisioningType": {
        "title": "cloudPcProvisioningType",
        "enum": [
          "dedicated",
          "shared",
          "unknownFutureValue",
          "sharedByUser",
          "sharedByEntraGroup"
        ],
        "type": "string"
      },
      "microsoft.graph.cloudPcServicePlanType": {
        "title": "cloudPcServicePlanType",
        "enum": [
          "enterprise",
          "business",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.cloudPcStatus": {
        "title": "cloudPcStatus",
        "enum": [
          "notProvisioned",
          "provisioning",
          "provisioned",
          "inGracePeriod",
          "deprovisioning",
          "failed",
          "provisionedWithWarnings",
          "resizing",
          "restoring",
          "pendingProvision",
          "unknownFutureValue",
          "movingRegion",
          "resizePendingLicense",
          "updatingSingleSignOn",
          "modifyingSingleSignOn"
        ],
        "type": "string"
      },
      "microsoft.graph.cloudPcUserAccountType": {
        "title": "cloudPcUserAccountType",
        "enum": [
          "standardUser",
          "administrator",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.cloudPcDiskEncryptionType": {
        "title": "cloudPcDiskEncryptionType",
        "enum": [
          "platformManagedKey",
          "customerManagedKey",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.ODataErrors.ODataError": {
        "required": [
          "error"
        ],
        "type": "object",
        "properties": {
          "error": {
            "$ref": "#/components/schemas/microsoft.graph.ODataErrors.MainError"
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.keyValuePair": {
        "title": "keyValuePair",
        "type": "object",
        "properties": {
          "name": {
            "type": "string",
            "description": "Name for this key-value pair"
          },
          "value": {
            "type": "string",
            "description": "Value for this key-value pair",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.settingSourceType": {
        "title": "settingSourceType",
        "enum": [
          "deviceConfiguration",
          "deviceIntent"
        ],
        "type": "string"
      },
      "microsoft.graph.deviceManagementConfigurationTemplateFamily": {
        "title": "deviceManagementConfigurationTemplateFamily",
        "enum": [
          "none",
          "endpointSecurityAntivirus",
          "endpointSecurityDiskEncryption",
          "endpointSecurityFirewall",
          "endpointSecurityEndpointDetectionAndResponse",
          "endpointSecurityAttackSurfaceReduction",
          "endpointSecurityAccountProtection",
          "endpointSecurityApplicationControl",
          "endpointSecurityEndpointPrivilegeManagement",
          "enrollmentConfiguration",
          "appQuietTime",
          "baseline",
          "unknownFutureValue",
          "deviceConfigurationScripts",
          "deviceConfigurationPolicies",
          "windowsOsRecoveryPolicies",
          "companyPortal"
        ],
        "type": "string",
        "description": "Describes the TemplateFamily for the Template entity",
        "x-ms-enum": {
          "name": "deviceManagementConfigurationTemplateFamily",
          "modelAsString": false,
          "values": [
            {
              "value": "none",
              "description": "Default for Template Family when Policy is not linked to a Template",
              "name": "none"
            },
            {
              "value": "endpointSecurityAntivirus",
              "description": "Template Family for EndpointSecurityAntivirus that manages the discrete group of antivirus settings for managed devices",
              "name": "endpointSecurityAntivirus"
            },
            {
              "value": "endpointSecurityDiskEncryption",
              "description": "Template Family for EndpointSecurityDiskEncryption that provides settings that are relevant for a devices built-in encryption  method, like FileVault or BitLocker",
              "name": "endpointSecurityDiskEncryption"
            },
            {
              "value": "endpointSecurityFirewall",
              "description": "Template Family for EndpointSecurityFirewall that helps configure a devices built-in firewall for device that run macOS and Windows 10",
              "name": "endpointSecurityFirewall"
            },
            {
              "value": "endpointSecurityEndpointDetectionAndResponse",
              "description": "Template Family for EndpointSecurityEndpointDetectionAndResponse that facilitates management of the EDR settings and onboard devices to Microsoft Defender for Endpoint",
              "name": "endpointSecurityEndpointDetectionAndResponse"
            },
            {
              "value": "endpointSecurityAttackSurfaceReduction",
              "description": "Template Family for EndpointSecurityAttackSurfaceReduction that help reduce your attack surfaces, by minimizing the places where your organization is vulnerable to cyberthreats and attacks",
              "name": "endpointSecurityAttackSurfaceReduction"
            },
            {
              "value": "endpointSecurityAccountProtection",
              "description": "Template Family for EndpointSecurityAccountProtection that facilitates protecting the identity and accounts of users",
              "name": "endpointSecurityAccountProtection"
            },
            {
              "value": "endpointSecurityApplicationControl",
              "description": "Template Family for ApplicationControl that helps mitigate security threats by restricting the applications that users can run and the code that runs in the System Core (kernel)",
              "name": "endpointSecurityApplicationControl"
            },
            {
              "value": "endpointSecurityEndpointPrivilegeManagement",
              "description": "Template Family for EPM Elevation Rules",
              "name": "endpointSecurityEndpointPrivilegeManagement"
            },
            {
              "value": "enrollmentConfiguration",
              "description": "Template Family for EnrollmentConfiguration",
              "name": "enrollmentConfiguration"
            },
            {
              "value": "appQuietTime",
              "description": "Template Family for QuietTimeIndicates Template Family for all the Apps QuietTime policies and templates",
              "name": "appQuietTime"
            },
            {
              "value": "baseline",
              "description": "Template Family for Baseline",
              "name": "baseline"
            },
            {
              "value": "unknownFutureValue",
              "description": "Evolvable enumeration sentinel value. Do not use.",
              "name": "unknownFutureValue"
            },
            {
              "value": "deviceConfigurationScripts",
              "description": "Template Family for device configuration scripts",
              "name": "deviceConfigurationScripts"
            },
            {
              "value": "deviceConfigurationPolicies",
              "description": "Template Family for device configuration policies",
              "name": "deviceConfigurationPolicies"
            },
            {
              "value": "windowsOsRecoveryPolicies",
              "description": "Template Family for windowsOsRecovery that can be applied during a Windows operating system recovery",
              "name": "windowsOsRecoveryPolicies"
            },
            {
              "value": "companyPortal",
              "description": "Template Family for Company Portal settings",
              "name": "companyPortal"
            }
          ]
        }
      },
      "microsoft.graph.deviceAndAppManagementAssignmentSource": {
        "title": "deviceAndAppManagementAssignmentSource",
        "enum": [
          "direct",
          "policySets"
        ],
        "type": "string",
        "description": "Represents source of assignment.",
        "x-ms-enum": {
          "name": "deviceAndAppManagementAssignmentSource",
          "modelAsString": false,
          "values": [
            {
              "value": "direct",
              "description": "Direct indicates a direct assignment.",
              "name": "direct"
            },
            {
              "value": "policySets",
              "description": "PolicySets indicates assignment was made via PolicySet assignment.",
              "name": "policySets"
            }
          ]
        }
      },
      "microsoft.graph.deviceAndAppManagementAssignmentTarget": {
        "title": "deviceAndAppManagementAssignmentTarget",
        "type": "object",
        "properties": {
          "deviceAndAppManagementAssignmentFilterId": {
            "type": "string",
            "description": "The Id of the filter for the target assignment.",
            "nullable": true
          },
          "deviceAndAppManagementAssignmentFilterType": {
            "$ref": "#/components/schemas/microsoft.graph.deviceAndAppManagementAssignmentFilterType"
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Base type for assignment targets."
      },
      "microsoft.graph.deviceManagementConfigurationSettingInstance": {
        "title": "deviceManagementConfigurationSettingInstance",
        "type": "object",
        "properties": {
          "settingDefinitionId": {
            "type": "string",
            "description": "Setting Definition Id"
          },
          "settingInstanceTemplateReference": {
            "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference"
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Setting instance within policy"
      },
      "microsoft.graph.deviceManagementConfigurationSettingDefinition": {
        "allOf": [
          {
            "$ref": "#/components/schemas/microsoft.graph.entity"
          },
          {
            "title": "deviceManagementConfigurationSettingDefinition",
            "type": "object",
            "properties": {
              "accessTypes": {
                "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationSettingAccessTypes"
              },
              "applicability": {
                "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationSettingApplicability"
              },
              "baseUri": {
                "type": "string",
                "description": "Base CSP Path",
                "nullable": true
              },
              "categoryId": {
                "type": "string",
                "description": "Specify category in which the setting is under. Support $filters.",
                "nullable": true
              },
              "description": {
                "type": "string",
                "description": "Description of the setting.",
                "nullable": true
              },
              "displayName": {
                "type": "string",
                "description": "Name of the setting. For example: Allow Toast.",
                "nullable": true
              },
              "helpText": {
                "type": "string",
                "description": "Help text of the setting. Give more details of the setting.",
                "nullable": true
              },
              "infoUrls": {
                "type": "array",
                "items": {
                  "type": "string",
                  "nullable": true
                },
                "description": "List of links more info for the setting can be found at."
              },
              "keywords": {
                "type": "array",
                "items": {
                  "type": "string",
                  "nullable": true
                },
                "description": "Tokens which to search settings on"
              },
              "name": {
                "type": "string",
                "description": "Name of the item",
                "nullable": true
              },
              "occurrence": {
                "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationSettingOccurrence"
              },
              "offsetUri": {
                "type": "string",
                "description": "Offset CSP Path from Base",
                "nullable": true
              },
              "referredSettingInformationList": {
                "type": "array",
                "items": {
                  "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationReferredSettingInformation"
                },
                "description": "List of referred setting information."
              },
              "rootDefinitionId": {
                "type": "string",
                "description": "Root setting definition id if the setting is a child setting.",
                "nullable": true
              },
              "settingUsage": {
                "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationSettingUsage"
              },
              "uxBehavior": {
                "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationControlType"
              },
              "version": {
                "type": "string",
                "description": "Item Version",
                "nullable": true
              },
              "visibility": {
                "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationSettingVisibility"
              }
            },
            "additionalProperties": {
              "type": "object"
            }
          }
        ]
      },
      "microsoft.graph.managedDeviceWindowsOperatingSystemEditionType": {
        "title": "managedDeviceWindowsOperatingSystemEditionType",
        "enum": [
          "professional",
          "professionalN",
          "enterprise",
          "enterpriseN",
          "education",
          "educationN",
          "proEducation",
          "proEducationN",
          "proWorkstation",
          "proWorkstationN",
          "unknownFutureValue"
        ],
        "type": "string",
        "description": "Windows Operating System is available in different editions, which have a specific set of features available. This enum type defines the corresponding edition.",
        "x-ms-enum": {
          "name": "managedDeviceWindowsOperatingSystemEditionType",
          "modelAsString": false,
          "values": [
            {
              "value": "professional",
              "description": "Default. Indicates Professional Operating System edition used for the managed device.",
              "name": "professional"
            },
            {
              "value": "professionalN",
              "description": "Indicates Professional N Operating System edition used for the managed device.",
              "name": "professionalN"
            },
            {
              "value": "enterprise",
              "description": "Indicates Enterprise Operating System edition used for the managed device.",
              "name": "enterprise"
            },
            {
              "value": "enterpriseN",
              "description": "Indicates Enterprise N Operating System edition used for the managed device.",
              "name": "enterpriseN"
            },
            {
              "value": "education",
              "description": "Indicates Education Operating System edition used for the managed device.",
              "name": "education"
            },
            {
              "value": "educationN",
              "description": "Indicates Education N Operating System edition used for the managed device.",
              "name": "educationN"
            },
            {
              "value": "proEducation",
              "description": "Indicates Pro Education Operating System edition used for the managed device.",
              "name": "proEducation"
            },
            {
              "value": "proEducationN",
              "description": "Indicates Pro Education N Operating System edition used for the managed device.",
              "name": "proEducationN"
            },
            {
              "value": "proWorkstation",
              "description": "Indicates Pro Workstation Operating System edition used for the managed device.",
              "name": "proWorkstation"
            },
            {
              "value": "proWorkstationN",
              "description": "Indicates Pro Workstation N Operating System edition used for the managed device.",
              "name": "proWorkstationN"
            },
            {
              "value": "unknownFutureValue",
              "description": "Evolvable enumeration sentinel value. Do not use.",
              "name": "unknownFutureValue"
            }
          ]
        }
      },
      "microsoft.graph.deviceManagement.aggregationType": {
        "title": "aggregationType",
        "enum": [
          "count",
          "percentage",
          "affectedCloudPcCount",
          "affectedCloudPcPercentage",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.identity": {
        "title": "identity",
        "type": "object",
        "properties": {
          "displayName": {
            "type": "string",
            "description": "The display name of the identity. For drive items, the display name might not always be available or up to date. For example, if a user changes their display name the API might show the new value in a future response, but the items associated with the user don't show up as changed when using delta.",
            "nullable": true
          },
          "id": {
            "type": "string",
            "description": "Unique identifier for the identity or actor. For example, in the access reviews decisions API, this property might record the id of the principal, that is, the group, user, or application that's subject to review.",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.cloudPcHealthCheckItem": {
        "title": "cloudPcHealthCheckItem",
        "type": "object",
        "properties": {
          "additionalDetails": {
            "type": "string",
            "description": "Additional message for this health check.",
            "nullable": true
          },
          "displayName": {
            "type": "string",
            "description": "The connectivity health check item name."
          },
          "lastHealthCheckDateTime": {
            "pattern": "^[0-9]{4,}-(0[1-9]|1[012])-(0[1-9]|[12][0-9]|3[01])T([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]([.][0-9]{1,12})?(Z|[+-][0-9][0-9]:[0-9][0-9])$",
            "type": "string",
            "description": "Timestamp when the last check occurs. The timestamp is shown in ISO 8601 format and Coordinated Universal Time (UTC). For example, midnight UTC on Jan 1, 2014 appears as 2014-01-01T00:00:00Z.",
            "format": "date-time",
            "nullable": true
          },
          "result": {
            "$ref": "#/components/schemas/microsoft.graph.cloudPcConnectivityEventResult"
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.cloudPcConnectivityStatus": {
        "title": "cloudPcConnectivityStatus",
        "enum": [
          "unknown",
          "available",
          "availableWithWarning",
          "unavailable",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.cloudPcDisasterRecoveryCapabilityType": {
        "title": "cloudPcDisasterRecoveryCapabilityType",
        "enum": [
          "none",
          "failover",
          "failback",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.cloudPcPartnerAgentInstallStatus": {
        "title": "cloudPcPartnerAgentInstallStatus",
        "enum": [
          "installed",
          "installFailed",
          "installing",
          "uninstalling",
          "uninstallFailed",
          "licensed",
          "unknownFutureValue"
        ],
        "type": "string"
      },
      "microsoft.graph.cloudPcPartnerAgentName": {
        "title": "cloudPcPartnerAgentName",
        "enum": [
          "citrix",
          "unknownFutureValue",
          "vMware",
          "hp"
        ],
        "type": "string"
      },
      "microsoft.graph.ODataErrors.MainError": {
        "required": [
          "code",
          "message"
        ],
        "type": "object",
        "properties": {
          "code": {
            "type": "string"
          },
          "message": {
            "type": "string",
            "x-ms-primary-error-message": true
          },
          "target": {
            "type": "string",
            "nullable": true
          },
          "details": {
            "type": "array",
            "items": {
              "$ref": "#/components/schemas/microsoft.graph.ODataErrors.ErrorDetails"
            }
          },
          "innerError": {
            "$ref": "#/components/schemas/microsoft.graph.ODataErrors.InnerError"
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.deviceAndAppManagementAssignmentFilterType": {
        "title": "deviceAndAppManagementAssignmentFilterType",
        "enum": [
          "none",
          "include",
          "exclude"
        ],
        "type": "string",
        "description": "Represents type of the assignment filter.",
        "x-ms-enum": {
          "name": "deviceAndAppManagementAssignmentFilterType",
          "modelAsString": false,
          "values": [
            {
              "value": "none",
              "description": "Default value. Do not use.",
              "name": "none"
            },
            {
              "value": "include",
              "description": "Indicates in-filter, rule matching will offer the payload to devices.",
              "name": "include"
            },
            {
              "value": "exclude",
              "description": "Indicates out-filter, rule matching will not offer the payload to devices.",
              "name": "exclude"
            }
          ]
        }
      },
      "microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference": {
        "title": "deviceManagementConfigurationSettingInstanceTemplateReference",
        "type": "object",
        "properties": {
          "settingInstanceTemplateId": {
            "type": "string",
            "description": "Setting instance template id"
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Setting instance template reference information"
      },
      "microsoft.graph.deviceManagementConfigurationSettingAccessTypes": {
        "title": "deviceManagementConfigurationSettingAccessTypes",
        "enum": [
          "none",
          "add",
          "copy",
          "delete",
          "get",
          "replace",
          "execute"
        ],
        "type": "string",
        "x-ms-enum-flags": {
          "isFlags": true
        }
      },
      "microsoft.graph.deviceManagementConfigurationSettingApplicability": {
        "title": "deviceManagementConfigurationSettingApplicability",
        "type": "object",
        "properties": {
          "description": {
            "type": "string",
            "description": "description of the setting",
            "nullable": true
          },
          "deviceMode": {
            "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationDeviceMode"
          },
          "platform": {
            "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationPlatforms"
          },
          "technologies": {
            "$ref": "#/components/schemas/microsoft.graph.deviceManagementConfigurationTechnologies"
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.deviceManagementConfigurationSettingOccurrence": {
        "title": "deviceManagementConfigurationSettingOccurrence",
        "type": "object",
        "properties": {
          "maxDeviceOccurrence": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Maximum times setting can be set on device.",
            "format": "int32",
            "nullable": true
          },
          "minDeviceOccurrence": {
            "maximum": 2147483647,
            "minimum": -2147483648,
            "type": "integer",
            "description": "Minimum times setting can be set on device. A MinDeviceOccurrence of 0 means setting is optional",
            "format": "int32",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.deviceManagementConfigurationReferredSettingInformation": {
        "title": "deviceManagementConfigurationReferredSettingInformation",
        "type": "object",
        "properties": {
          "settingDefinitionId": {
            "type": "string",
            "description": "Setting definition id that is being referred to a setting. Applicable for reusable setting",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        },
        "description": "Referred setting information about reusable setting"
      },
      "microsoft.graph.deviceManagementConfigurationSettingUsage": {
        "title": "deviceManagementConfigurationSettingUsage",
        "enum": [
          "none",
          "configuration",
          "compliance",
          "unknownFutureValue"
        ],
        "type": "string",
        "description": "Supported setting types",
        "x-ms-enum-flags": {
          "isFlags": true
        },
        "x-ms-enum": {
          "name": "deviceManagementConfigurationSettingUsage",
          "modelAsString": false,
          "values": [
            {
              "value": "none",
              "description": "Default. No setting type specified.",
              "name": "none"
            },
            {
              "value": "configuration",
              "description": "Configuration setting type.",
              "name": "configuration"
            },
            {
              "value": "compliance",
              "description": "Compliance setting type.",
              "name": "compliance"
            },
            {
              "value": "unknownFutureValue",
              "description": "Evolvable enumeration sentinel value. Do not use.",
              "name": "unknownFutureValue"
            }
          ]
        }
      },
      "microsoft.graph.deviceManagementConfigurationControlType": {
        "title": "deviceManagementConfigurationControlType",
        "enum": [
          "default",
          "dropdown",
          "smallTextBox",
          "largeTextBox",
          "toggle",
          "multiheaderGrid",
          "contextPane",
          "unknownFutureValue"
        ],
        "type": "string",
        "description": "Setting control type representation in the UX",
        "x-ms-enum": {
          "name": "deviceManagementConfigurationControlType",
          "modelAsString": false,
          "values": [
            {
              "value": "default",
              "description": "Default. UX uses default UX element base on setting type for the setting.",
              "name": "default"
            },
            {
              "value": "dropdown",
              "description": "Display the setting in dropdown box.",
              "name": "dropdown"
            },
            {
              "value": "smallTextBox",
              "description": "Display text input in small text input.",
              "name": "smallTextBox"
            },
            {
              "value": "largeTextBox",
              "description": "Display text input in large text input.",
              "name": "largeTextBox"
            },
            {
              "value": "toggle",
              "description": "Allow for toggle control type.",
              "name": "toggle"
            },
            {
              "value": "multiheaderGrid",
              "description": "Allow for multiheader grid control type.",
              "name": "multiheaderGrid"
            },
            {
              "value": "contextPane",
              "description": "Allow for context pane control type.",
              "name": "contextPane"
            },
            {
              "value": "unknownFutureValue",
              "description": "Evolvable enumeration sentinel value. Do not use.",
              "name": "unknownFutureValue"
            }
          ]
        }
      },
      "microsoft.graph.deviceManagementConfigurationSettingVisibility": {
        "title": "deviceManagementConfigurationSettingVisibility",
        "enum": [
          "none",
          "settingsCatalog",
          "template",
          "unknownFutureValue"
        ],
        "type": "string",
        "description": "Supported setting types",
        "x-ms-enum-flags": {
          "isFlags": true
        },
        "x-ms-enum": {
          "name": "deviceManagementConfigurationSettingVisibility",
          "modelAsString": false,
          "values": [
            {
              "value": "none",
              "description": "Default. Not visible.",
              "name": "none"
            },
            {
              "value": "settingsCatalog",
              "description": "Visible to setting catalog policy type.",
              "name": "settingsCatalog"
            },
            {
              "value": "template",
              "description": "Visible to template policy type.",
              "name": "template"
            },
            {
              "value": "unknownFutureValue",
              "description": "Evolvable enumeration sentinel value. Do not use.",
              "name": "unknownFutureValue"
            }
          ]
        }
      },
      "microsoft.graph.ODataErrors.ErrorDetails": {
        "required": [
          "code",
          "message"
        ],
        "type": "object",
        "properties": {
          "code": {
            "type": "string"
          },
          "message": {
            "type": "string"
          },
          "target": {
            "type": "string",
            "nullable": true
          }
        },
        "additionalProperties": {
          "type": "object"
        }
      },
      "microsoft.graph.ODataErrors.InnerError": {
        "type": "object",
        "additionalProperties": {
          "type": "object"
        },
        "description": "The structure of this object is service-specific"
      },
      "microsoft.graph.deviceManagementConfigurationDeviceMode": {
        "title": "deviceManagementConfigurationDeviceMode",
        "enum": [
          "none",
          "kiosk"
        ],
        "type": "string",
        "description": "Describes applicability for the mode the device is in",
        "x-ms-enum": {
          "name": "deviceManagementConfigurationDeviceMode",
          "modelAsString": false,
          "values": [
            {
              "value": "none",
              "description": "No Device Mode specified",
              "name": "none"
            },
            {
              "value": "kiosk",
              "description": "Device must be in kiosk mode for this setting to apply",
              "name": "kiosk"
            }
          ]
        }
      }
    },
    "responses": {
      "error": {
        "description": "error",
        "content": {
          "application/json": {
            "schema": {
              "$ref": "#/components/schemas/microsoft.graph.ODataErrors.ODataError"
            }
          }
        }
      }
    },
    "parameters": {
      "top": {
        "name": "$top",
        "in": "query",
        "description": "Show only the first n items",
        "style": "form",
        "explode": false,
        "schema": {
          "minimum": 0,
          "type": "integer"
        },
        "example": 50
      },
      "skip": {
        "name": "$skip",
        "in": "query",
        "description": "Skip the first n items",
        "style": "form",
        "explode": false,
        "schema": {
          "minimum": 0,
          "type": "integer"
        }
      },
      "search": {
        "name": "$search",
        "in": "query",
        "description": "Search items by search phrases",
        "style": "form",
        "explode": false,
        "schema": {
          "type": "string"
        }
      },
      "filter": {
        "name": "$filter",
        "in": "query",
        "description": "Filter items by property values",
        "style": "form",
        "explode": false,
        "schema": {
          "type": "string"
        }
      },
      "count": {
        "name": "$count",
        "in": "query",
        "description": "Include count of items",
        "style": "form",
        "explode": false,
        "schema": {
          "type": "boolean"
        }
      }
    },
    "securitySchemes": {
      "azureaadv2": {
        "type": "oauth2",
        "flows": {
          "authorizationCode": {
            "authorizationUrl": "https://login.microsoftonline.com/common/oauth2/v2.0/authorize",
            "tokenUrl": "https://login.microsoftonline.com/common/oauth2/v2.0/token",
            "scopes": {}
          }
        }
      }
    }
  },
  "security": [
    {
      "azureaadv2": []
    }
  ]
}